Opened \\192.168.1.254\pipe\com_1
Waiting to reconnect...
Connected to Windows 7 7600 x64 target at (Fri Dec 30 09:35:02.406 2011 (UTC + 8:00)), ptr64 TRUE
Kernel Debugger connection established.
Symbol search path is: symsrv*symsrv.dll*E:\debug*http://msdl.microsoft.com/download/symbols
Executable search path is: 
Windows 7 Kernel Version 7600 MP (1 procs) Free x64
Product: WinNt, suite: TerminalServer SingleUserTS
Built by: 7600.16385.amd64fre.win7_rtm.090713-1255
Machine Name:
Kernel base = 0xfffff800`03a4e000 PsLoadedModuleList = 0xfffff800`03c8be50
Debug session time: Fri Dec 30 09:35:06.109 2011 (UTC + 8:00)
System Uptime: 0 days 0:45:08.312
Break instruction exception - code 80000003 (first chance)
*******************************************************************************
*                                                                             *
*   You are seeing this message because you pressed either                    *
*       CTRL+C (if you run kd.exe) or,                                        *
*       CTRL+BREAK (if you run WinDBG),                                       *
*   on your debugger machine's keyboard.                                      *
*                                                                             *
*                   THIS IS NOT A BUG OR A SYSTEM CRASH                       *
*                                                                             *

*                                                                             *
* If you did not intend to break into the debugger, press the "g" key, then   *
* press the "Enter" key now.  This message might immediately reappear.  If it *
* does, press "g" and "Enter" again.                                          *
*                                                                             *
*******************************************************************************
nt!DbgBreakPointWithStatus:
fffff800`03ab7f60 cc              int     3
kd> g
Break instruction exception - code 80000003 (first chance)
*******************************************************************************
*                                                                             *
*   You are seeing this message because you pressed either                    *
*       CTRL+C (if you run kd.exe) or,                                        *
*       CTRL+BREAK (if you run WinDBG),                                       *
*   on your debugger machine's keyboard.                                      *
*                                                                             *
*                   THIS IS NOT A BUG OR A SYSTEM CRASH                       *
*                                                                             *
* If you did not intend to break into the debugger, press the "g" key, then   *
* press the "Enter" key now.  This message might immediately reappear.  If it *
* does, press "g" and "Enter" again.                                          *
*                                                                             *
*******************************************************************************
nt!DbgBreakPointWithStatus:
fffff800`03ab7f60 cc              int     3
kd> .reload
Connected to Windows 7 7600 x64 target at (Fri Dec 30 09:36:28.281 2011 (UTC + 8:00)), ptr64 TRUE
Loading Kernel Symbols
...............................................................
................................................................
......
Loading User Symbols

Loading unloaded module list
....
*** ERROR: Module load completed but symbols could not be loaded for intelide.sys
*** ERROR: Module load completed but symbols could not be loaded for spldr.sys
*** ERROR: Module load completed but symbols could not be loaded for peauth.sys
*** ERROR: Module load completed but symbols could not be loaded for secdrv.SYS
*** ERROR: Symbol file could not be found.  Defaulted to export symbols for spsys.sys - 
*** ERROR: Module load completed but symbols could not be loaded for intelppm.sys
kd> vertarget
Windows 7 Kernel Version 7600 MP (1 procs) Free x64
Product: WinNt, suite: TerminalServer SingleUserTS
Built by: 7600.16385.amd64fre.win7_rtm.090713-1255
Machine Name:
Kernel base = 0xfffff800`03a4e000 PsLoadedModuleList = 0xfffff800`03c8be50
Debug session time: Fri Dec 30 09:36:52.649 2011 (UTC + 8:00)
System Uptime: 0 days 0:46:23.734
kd> dt _EPROCESS
nt!_EPROCESS
   +0x000 Pcb              : _KPROCESS
   +0x160 ProcessLock      : _EX_PUSH_LOCK
   +0x168 CreateTime       : _LARGE_INTEGER
   +0x170 ExitTime         : _LARGE_INTEGER
   +0x178 RundownProtect   : _EX_RUNDOWN_REF
   +0x180 UniqueProcessId  : Ptr64 Void
   +0x188 ActiveProcessLinks : _LIST_ENTRY
   +0x198 ProcessQuotaUsage : [2] Uint8B
   +0x1a8 ProcessQuotaPeak : [2] Uint8B
   +0x1b8 CommitCharge     : Uint8B
   +0x1c0 QuotaBlock       : Ptr64 _EPROCESS_QUOTA_BLOCK
   +0x1c8 CpuQuotaBlock    : Ptr64 _PS_CPU_QUOTA_BLOCK
   +0x1d0 PeakVirtualSize  : Uint8B
   +0x1d8 VirtualSize      : Uint8B
   +0x1e0 SessionProcessLinks : _LIST_ENTRY
   +0x1f0 DebugPort        : Ptr64 Void
   +0x1f8 ExceptionPortData : Ptr64 Void
   +0x1f8 ExceptionPortValue : Uint8B
   +0x1f8 ExceptionPortState : Pos 0, 3 Bits
   +0x200 ObjectTable      : Ptr64 _HANDLE_TABLE
   +0x208 Token            : _EX_FAST_REF
   +0x210 WorkingSetPage   : Uint8B
   +0x218 AddressCreationLock : _EX_PUSH_LOCK
   +0x220 RotateInProgress : Ptr64 _ETHREAD
   +0x228 ForkInProgress   : Ptr64 _ETHREAD
   +0x230 HardwareTrigger  : Uint8B
   +0x238 PhysicalVadRoot  : Ptr64 _MM_AVL_TABLE
   +0x240 CloneRoot        : Ptr64 Void
   +0x248 NumberOfPrivatePages : Uint8B
   +0x250 NumberOfLockedPages : Uint8B
   +0x258 Win32Process     : Ptr64 Void
   +0x260 Job              : Ptr64 _EJOB
   +0x268 SectionObject    : Ptr64 Void
   +0x270 SectionBaseAddress : Ptr64 Void
   +0x278 Cookie           : Uint4B
   +0x27c UmsScheduledThreads : Uint4B
   +0x280 WorkingSetWatch  : Ptr64 _PAGEFAULT_HISTORY
   +0x288 Win32WindowStation : Ptr64 Void
   +0x290 InheritedFromUniqueProcessId : Ptr64 Void
   +0x298 LdtInformation   : Ptr64 Void
   +0x2a0 Spare            : Ptr64 Void
   +0x2a8 ConsoleHostProcess : Uint8B
   +0x2b0 DeviceMap        : Ptr64 Void
   +0x2b8 EtwDataSource    : Ptr64 Void
   +0x2c0 FreeTebHint      : Ptr64 Void
   +0x2c8 FreeUmsTebHint   : Ptr64 Void
   +0x2d0 PageDirectoryPte : _HARDWARE_PTE
   +0x2d0 Filler           : Uint8B
   +0x2d8 Session          : Ptr64 Void
   +0x2e0 ImageFileName    : [15] UChar
   +0x2ef PriorityClass    : UChar
   +0x2f0 JobLinks         : _LIST_ENTRY
   +0x300 LockedPagesList  : Ptr64 Void
   +0x308 ThreadListHead   : _LIST_ENTRY
   +0x318 SecurityPort     : Ptr64 Void
   +0x320 Wow64Process     : Ptr64 Void
   +0x328 ActiveThreads    : Uint4B
   +0x32c ImagePathHash    : Uint4B
   +0x330 DefaultHardErrorProcessing : Uint4B
   +0x334 LastThreadExitStatus : Int4B
   +0x338 Peb              : Ptr64 _PEB
   +0x340 PrefetchTrace    : _EX_FAST_REF
   +0x348 ReadOperationCount : _LARGE_INTEGER
   +0x350 WriteOperationCount : _LARGE_INTEGER
   +0x358 OtherOperationCount : _LARGE_INTEGER
   +0x360 ReadTransferCount : _LARGE_INTEGER
   +0x368 WriteTransferCount : _LARGE_INTEGER
   +0x370 OtherTransferCount : _LARGE_INTEGER
   +0x378 CommitChargeLimit : Uint8B
   +0x380 CommitChargePeak : Uint8B
   +0x388 AweInfo          : Ptr64 Void
   +0x390 SeAuditProcessCreationInfo : _SE_AUDIT_PROCESS_CREATION_INFO
   +0x398 Vm               : _MMSUPPORT
   +0x420 MmProcessLinks   : _LIST_ENTRY
   +0x430 HighestUserAddress : Ptr64 Void
   +0x438 ModifiedPageCount : Uint4B
   +0x43c Flags2           : Uint4B
   +0x43c JobNotReallyActive : Pos 0, 1 Bit
   +0x43c AccountingFolded : Pos 1, 1 Bit
   +0x43c NewProcessReported : Pos 2, 1 Bit
   +0x43c ExitProcessReported : Pos 3, 1 Bit
   +0x43c ReportCommitChanges : Pos 4, 1 Bit
   +0x43c LastReportMemory : Pos 5, 1 Bit
   +0x43c ReportPhysicalPageChanges : Pos 6, 1 Bit
   +0x43c HandleTableRundown : Pos 7, 1 Bit
   +0x43c NeedsHandleRundown : Pos 8, 1 Bit
   +0x43c RefTraceEnabled  : Pos 9, 1 Bit
   +0x43c NumaAware        : Pos 10, 1 Bit
   +0x43c ProtectedProcess : Pos 11, 1 Bit
   +0x43c DefaultPagePriority : Pos 12, 3 Bits
   +0x43c PrimaryTokenFrozen : Pos 15, 1 Bit
   +0x43c ProcessVerifierTarget : Pos 16, 1 Bit
   +0x43c StackRandomizationDisabled : Pos 17, 1 Bit
   +0x43c AffinityPermanent : Pos 18, 1 Bit
   +0x43c AffinityUpdateEnable : Pos 19, 1 Bit
   +0x43c PropagateNode    : Pos 20, 1 Bit
   +0x43c ExplicitAffinity : Pos 21, 1 Bit
   +0x440 Flags            : Uint4B
   +0x440 CreateReported   : Pos 0, 1 Bit
   +0x440 NoDebugInherit   : Pos 1, 1 Bit
   +0x440 ProcessExiting   : Pos 2, 1 Bit
   +0x440 ProcessDelete    : Pos 3, 1 Bit
   +0x440 Wow64SplitPages  : Pos 4, 1 Bit
   +0x440 VmDeleted        : Pos 5, 1 Bit
   +0x440 OutswapEnabled   : Pos 6, 1 Bit
   +0x440 Outswapped       : Pos 7, 1 Bit
   +0x440 ForkFailed       : Pos 8, 1 Bit
   +0x440 Wow64VaSpace4Gb  : Pos 9, 1 Bit
   +0x440 AddressSpaceInitialized : Pos 10, 2 Bits
   +0x440 SetTimerResolution : Pos 12, 1 Bit
   +0x440 BreakOnTermination : Pos 13, 1 Bit
   +0x440 DeprioritizeViews : Pos 14, 1 Bit
   +0x440 WriteWatch       : Pos 15, 1 Bit
   +0x440 ProcessInSession : Pos 16, 1 Bit
   +0x440 OverrideAddressSpace : Pos 17, 1 Bit
   +0x440 HasAddressSpace  : Pos 18, 1 Bit
   +0x440 LaunchPrefetched : Pos 19, 1 Bit
   +0x440 InjectInpageErrors : Pos 20, 1 Bit
   +0x440 VmTopDown        : Pos 21, 1 Bit
   +0x440 ImageNotifyDone  : Pos 22, 1 Bit
   +0x440 PdeUpdateNeeded  : Pos 23, 1 Bit
   +0x440 VdmAllowed       : Pos 24, 1 Bit
   +0x440 CrossSessionCreate : Pos 25, 1 Bit
   +0x440 ProcessInserted  : Pos 26, 1 Bit
   +0x440 DefaultIoPriority : Pos 27, 3 Bits
   +0x440 ProcessSelfDelete : Pos 30, 1 Bit
   +0x440 SetTimerResolutionLink : Pos 31, 1 Bit
   +0x444 ExitStatus       : Int4B
   +0x448 VadRoot          : _MM_AVL_TABLE
   +0x488 AlpcContext      : _ALPC_PROCESS_CONTEXT
   +0x4a8 TimerResolutionLink : _LIST_ENTRY
   +0x4b8 RequestedTimerResolution : Uint4B
   +0x4bc ActiveThreadsHighWatermark : Uint4B
   +0x4c0 SmallestTimerResolution : Uint4B
   +0x4c8 TimerResolutionStackRecord : Ptr64 _PO_DIAG_STACK_RECORD
kd> g
Break instruction exception - code 80000003 (first chance)
*******************************************************************************
*                                                                             *
*   You are seeing this message because you pressed either                    *
*       CTRL+C (if you run kd.exe) or,                                        *
*       CTRL+BREAK (if you run WinDBG),                                       *
*   on your debugger machine's keyboard.                                      *
*                                                                             *
*                   THIS IS NOT A BUG OR A SYSTEM CRASH                       *
*                                                                             *
* If you did not intend to break into the debugger, press the "g" key, then   *
* press the "Enter" key now.  This message might immediately reappear.  If it *
* does, press "g" and "Enter" again.                                          *
*                                                                             *
*******************************************************************************
nt!DbgBreakPointWithStatus:
fffff800`03ab7f60 cc              int     3
kd> dt _PEB
nt!_PEB
   +0x000 InheritedAddressSpace : UChar
   +0x001 ReadImageFileExecOptions : UChar
   +0x002 BeingDebugged    : UChar
   +0x003 BitField         : UChar
   +0x003 ImageUsesLargePages : Pos 0, 1 Bit
   +0x003 IsProtectedProcess : Pos 1, 1 Bit
   +0x003 IsLegacyProcess  : Pos 2, 1 Bit
   +0x003 IsImageDynamicallyRelocated : Pos 3, 1 Bit
   +0x003 SkipPatchingUser32Forwarders : Pos 4, 1 Bit
   +0x003 SpareBits        : Pos 5, 3 Bits
   +0x008 Mutant           : Ptr64 Void
   +0x010 ImageBaseAddress : Ptr64 Void
   +0x018 Ldr              : Ptr64 _PEB_LDR_DATA
   +0x020 ProcessParameters : Ptr64 _RTL_USER_PROCESS_PARAMETERS
   +0x028 SubSystemData    : Ptr64 Void
   +0x030 ProcessHeap      : Ptr64 Void
   +0x038 FastPebLock      : Ptr64 _RTL_CRITICAL_SECTION
   +0x040 AtlThunkSListPtr : Ptr64 Void
   +0x048 IFEOKey          : Ptr64 Void
   +0x050 CrossProcessFlags : Uint4B
   +0x050 ProcessInJob     : Pos 0, 1 Bit
   +0x050 ProcessInitializing : Pos 1, 1 Bit
   +0x050 ProcessUsingVEH  : Pos 2, 1 Bit
   +0x050 ProcessUsingVCH  : Pos 3, 1 Bit
   +0x050 ProcessUsingFTH  : Pos 4, 1 Bit
   +0x050 ReservedBits0    : Pos 5, 27 Bits
   +0x058 KernelCallbackTable : Ptr64 Void
   +0x058 UserSharedInfoPtr : Ptr64 Void
   +0x060 SystemReserved   : [1] Uint4B
   +0x064 AtlThunkSListPtr32 : Uint4B
   +0x068 ApiSetMap        : Ptr64 Void
   +0x070 TlsExpansionCounter : Uint4B
   +0x078 TlsBitmap        : Ptr64 Void
   +0x080 TlsBitmapBits    : [2] Uint4B
   +0x088 ReadOnlySharedMemoryBase : Ptr64 Void
   +0x090 HotpatchInformation : Ptr64 Void
   +0x098 ReadOnlyStaticServerData : Ptr64 Ptr64 Void
   +0x0a0 AnsiCodePageData : Ptr64 Void
   +0x0a8 OemCodePageData  : Ptr64 Void
   +0x0b0 UnicodeCaseTableData : Ptr64 Void
   +0x0b8 NumberOfProcessors : Uint4B
   +0x0bc NtGlobalFlag     : Uint4B
   +0x0c0 CriticalSectionTimeout : _LARGE_INTEGER
   +0x0c8 HeapSegmentReserve : Uint8B
   +0x0d0 HeapSegmentCommit : Uint8B
   +0x0d8 HeapDeCommitTotalFreeThreshold : Uint8B
   +0x0e0 HeapDeCommitFreeBlockThreshold : Uint8B
   +0x0e8 NumberOfHeaps    : Uint4B
   +0x0ec MaximumNumberOfHeaps : Uint4B
   +0x0f0 ProcessHeaps     : Ptr64 Ptr64 Void
   +0x0f8 GdiSharedHandleTable : Ptr64 Void
   +0x100 ProcessStarterHelper : Ptr64 Void
   +0x108 GdiDCAttributeList : Uint4B
   +0x110 LoaderLock       : Ptr64 _RTL_CRITICAL_SECTION
   +0x118 OSMajorVersion   : Uint4B
   +0x11c OSMinorVersion   : Uint4B
   +0x120 OSBuildNumber    : Uint2B
   +0x122 OSCSDVersion     : Uint2B
   +0x124 OSPlatformId     : Uint4B
   +0x128 ImageSubsystem   : Uint4B
   +0x12c ImageSubsystemMajorVersion : Uint4B
   +0x130 ImageSubsystemMinorVersion : Uint4B
   +0x138 ActiveProcessAffinityMask : Uint8B
   +0x140 GdiHandleBuffer  : [60] Uint4B
   +0x230 PostProcessInitRoutine : Ptr64     void 
   +0x238 TlsExpansionBitmap : Ptr64 Void
   +0x240 TlsExpansionBitmapBits : [32] Uint4B
   +0x2c0 SessionId        : Uint4B
   +0x2c8 AppCompatFlags   : _ULARGE_INTEGER
   +0x2d0 AppCompatFlagsUser : _ULARGE_INTEGER
   +0x2d8 pShimData        : Ptr64 Void
   +0x2e0 AppCompatInfo    : Ptr64 Void
   +0x2e8 CSDVersion       : _UNICODE_STRING
   +0x2f8 ActivationContextData : Ptr64 _ACTIVATION_CONTEXT_DATA
   +0x300 ProcessAssemblyStorageMap : Ptr64 _ASSEMBLY_STORAGE_MAP
   +0x308 SystemDefaultActivationContextData : Ptr64 _ACTIVATION_CONTEXT_DATA
   +0x310 SystemAssemblyStorageMap : Ptr64 _ASSEMBLY_STORAGE_MAP
   +0x318 MinimumStackCommit : Uint8B
   +0x320 FlsCallback      : Ptr64 _FLS_CALLBACK_INFO
   +0x328 FlsListHead      : _LIST_ENTRY
   +0x338 FlsBitmap        : Ptr64 Void
   +0x340 FlsBitmapBits    : [4] Uint4B
   +0x350 FlsHighIndex     : Uint4B
   +0x358 WerRegistrationData : Ptr64 Void
   +0x360 WerShipAssertPtr : Ptr64 Void
   +0x368 pContextData     : Ptr64 Void
   +0x370 pImageHeaderHash : Ptr64 Void
   +0x378 TracingFlags     : Uint4B
   +0x378 HeapTracingEnabled : Pos 0, 1 Bit
   +0x378 CritSecTracingEnabled : Pos 1, 1 Bit
   +0x378 SpareTracingBits : Pos 2, 30 Bits
kd> dt _PEB_LDR_DATA
nt!_PEB_LDR_DATA
   +0x000 Length           : Uint4B
   +0x004 Initialized      : UChar
   +0x008 SsHandle         : Ptr64 Void
   +0x010 InLoadOrderModuleList : _LIST_ENTRY
   +0x020 InMemoryOrderModuleList : _LIST_ENTRY
   +0x030 InInitializationOrderModuleList : _LIST_ENTRY
   +0x040 EntryInProgress  : Ptr64 Void
   +0x048 ShutdownInProgress : UChar
   +0x050 ShutdownThreadId : Ptr64 Void
kd> dt _LDR_DATA_TABLE_ENTRY
nt!_LDR_DATA_TABLE_ENTRY
   +0x000 InLoadOrderLinks : _LIST_ENTRY
   +0x010 InMemoryOrderLinks : _LIST_ENTRY
   +0x020 InInitializationOrderLinks : _LIST_ENTRY
   +0x030 DllBase          : Ptr64 Void
   +0x038 EntryPoint       : Ptr64 Void
   +0x040 SizeOfImage      : Uint4B
   +0x048 FullDllName      : _UNICODE_STRING
   +0x058 BaseDllName      : _UNICODE_STRING
   +0x068 Flags            : Uint4B
   +0x06c LoadCount        : Uint2B
   +0x06e TlsIndex         : Uint2B
   +0x070 HashLinks        : _LIST_ENTRY
   +0x070 SectionPointer   : Ptr64 Void
   +0x078 CheckSum         : Uint4B
   +0x080 TimeDateStamp    : Uint4B
   +0x080 LoadedImports    : Ptr64 Void
   +0x088 EntryPointActivationContext : Ptr64 _ACTIVATION_CONTEXT
   +0x090 PatchInformation : Ptr64 Void
   +0x098 ForwarderLinks   : _LIST_ENTRY
   +0x0a8 ServiceTagLinks  : _LIST_ENTRY
   +0x0b8 StaticLinks      : _LIST_ENTRY
   +0x0c8 ContextInformation : Ptr64 Void
   +0x0d0 OriginalBase     : Uint8B
   +0x0d8 LoadTime         : _LARGE_INTEGER
kd> dt _ETHREAD
nt!_ETHREAD
   +0x000 Tcb              : _KTHREAD
   +0x360 CreateTime       : _LARGE_INTEGER
   +0x368 ExitTime         : _LARGE_INTEGER
   +0x368 KeyedWaitChain   : _LIST_ENTRY
   +0x378 ExitStatus       : Int4B
   +0x380 PostBlockList    : _LIST_ENTRY
   +0x380 ForwardLinkShadow : Ptr64 Void
   +0x388 StartAddress     : Ptr64 Void
   +0x390 TerminationPort  : Ptr64 _TERMINATION_PORT
   +0x390 ReaperLink       : Ptr64 _ETHREAD
   +0x390 KeyedWaitValue   : Ptr64 Void
   +0x398 ActiveTimerListLock : Uint8B
   +0x3a0 ActiveTimerListHead : _LIST_ENTRY
   +0x3b0 Cid              : _CLIENT_ID
   +0x3c0 KeyedWaitSemaphore : _KSEMAPHORE
   +0x3c0 AlpcWaitSemaphore : _KSEMAPHORE
   +0x3e0 ClientSecurity   : _PS_CLIENT_SECURITY_CONTEXT
   +0x3e8 IrpList          : _LIST_ENTRY
   +0x3f8 TopLevelIrp      : Uint8B
   +0x400 DeviceToVerify   : Ptr64 _DEVICE_OBJECT
   +0x408 CpuQuotaApc      : Ptr64 _PSP_CPU_QUOTA_APC
   +0x410 Win32StartAddress : Ptr64 Void
   +0x418 LegacyPowerObject : Ptr64 Void
   +0x420 ThreadListEntry  : _LIST_ENTRY
   +0x430 RundownProtect   : _EX_RUNDOWN_REF
   +0x438 ThreadLock       : _EX_PUSH_LOCK
   +0x440 ReadClusterSize  : Uint4B
   +0x444 MmLockOrdering   : Int4B
   +0x448 CrossThreadFlags : Uint4B
   +0x448 Terminated       : Pos 0, 1 Bit
   +0x448 ThreadInserted   : Pos 1, 1 Bit
   +0x448 HideFromDebugger : Pos 2, 1 Bit
   +0x448 ActiveImpersonationInfo : Pos 3, 1 Bit
   +0x448 SystemThread     : Pos 4, 1 Bit
   +0x448 HardErrorsAreDisabled : Pos 5, 1 Bit
   +0x448 BreakOnTermination : Pos 6, 1 Bit
   +0x448 SkipCreationMsg  : Pos 7, 1 Bit
   +0x448 SkipTerminationMsg : Pos 8, 1 Bit
   +0x448 CopyTokenOnOpen  : Pos 9, 1 Bit
   +0x448 ThreadIoPriority : Pos 10, 3 Bits
   +0x448 ThreadPagePriority : Pos 13, 3 Bits
   +0x448 RundownFail      : Pos 16, 1 Bit
   +0x448 NeedsWorkingSetAging : Pos 17, 1 Bit
   +0x44c SameThreadPassiveFlags : Uint4B
   +0x44c ActiveExWorker   : Pos 0, 1 Bit
   +0x44c ExWorkerCanWaitUser : Pos 1, 1 Bit
   +0x44c MemoryMaker      : Pos 2, 1 Bit
   +0x44c ClonedThread     : Pos 3, 1 Bit
   +0x44c KeyedEventInUse  : Pos 4, 1 Bit
   +0x44c RateApcState     : Pos 5, 2 Bits
   +0x44c SelfTerminate    : Pos 7, 1 Bit
   +0x450 SameThreadApcFlags : Uint4B
   +0x450 Spare            : Pos 0, 1 Bit
   +0x450 StartAddressInvalid : Pos 1, 1 Bit
   +0x450 EtwPageFaultCalloutActive : Pos 2, 1 Bit
   +0x450 OwnsProcessWorkingSetExclusive : Pos 3, 1 Bit
   +0x450 OwnsProcessWorkingSetShared : Pos 4, 1 Bit
   +0x450 OwnsSystemCacheWorkingSetExclusive : Pos 5, 1 Bit
   +0x450 OwnsSystemCacheWorkingSetShared : Pos 6, 1 Bit
   +0x450 OwnsSessionWorkingSetExclusive : Pos 7, 1 Bit
   +0x451 OwnsSessionWorkingSetShared : Pos 0, 1 Bit
   +0x451 OwnsProcessAddressSpaceExclusive : Pos 1, 1 Bit
   +0x451 OwnsProcessAddressSpaceShared : Pos 2, 1 Bit
   +0x451 SuppressSymbolLoad : Pos 3, 1 Bit
   +0x451 Prefetching      : Pos 4, 1 Bit
   +0x451 OwnsDynamicMemoryShared : Pos 5, 1 Bit
   +0x451 OwnsChangeControlAreaExclusive : Pos 6, 1 Bit
   +0x451 OwnsChangeControlAreaShared : Pos 7, 1 Bit
   +0x452 OwnsPagedPoolWorkingSetExclusive : Pos 0, 1 Bit
   +0x452 OwnsPagedPoolWorkingSetShared : Pos 1, 1 Bit
   +0x452 OwnsSystemPtesWorkingSetExclusive : Pos 2, 1 Bit
   +0x452 OwnsSystemPtesWorkingSetShared : Pos 3, 1 Bit
   +0x452 TrimTrigger      : Pos 4, 2 Bits
   +0x452 Spare1           : Pos 6, 2 Bits
   +0x453 PriorityRegionActive : UChar
   +0x454 CacheManagerActive : UChar
   +0x455 DisablePageFaultClustering : UChar
   +0x456 ActiveFaultCount : UChar
   +0x457 LockOrderState   : UChar
   +0x458 AlpcMessageId    : Uint8B
   +0x460 AlpcMessage      : Ptr64 Void
   +0x460 AlpcReceiveAttributeSet : Uint4B
   +0x468 AlpcWaitListEntry : _LIST_ENTRY
   +0x478 CacheManagerCount : Uint4B
   +0x47c IoBoostCount     : Uint4B
   +0x480 IrpListLock      : Uint8B
   +0x488 ReservedForSynchTracking : Ptr64 Void
   +0x490 CmCallbackListHead : _SINGLE_LIST_ENTRY
kd> dt -b _ETHREAD
nt!_ETHREAD
   +0x000 Tcb              : _KTHREAD
      +0x000 Header           : _DISPATCHER_HEADER
         +0x000 Type             : UChar
         +0x001 TimerControlFlags : UChar
         +0x001 Absolute         : Pos 0, 1 Bit
         +0x001 Coalescable      : Pos 1, 1 Bit
         +0x001 KeepShifting     : Pos 2, 1 Bit
         +0x001 EncodedTolerableDelay : Pos 3, 5 Bits
         +0x001 Abandoned        : UChar
         +0x001 Signalling       : UChar
         +0x002 ThreadControlFlags : UChar
         +0x002 CpuThrottled     : Pos 0, 1 Bit
         +0x002 CycleProfiling   : Pos 1, 1 Bit
         +0x002 CounterProfiling : Pos 2, 1 Bit
         +0x002 Reserved         : Pos 3, 5 Bits
         +0x002 Hand             : UChar
         +0x002 Size             : UChar
         +0x003 TimerMiscFlags   : UChar
         +0x003 Index            : Pos 0, 6 Bits
         +0x003 Inserted         : Pos 6, 1 Bit
         +0x003 Expired          : Pos 7, 1 Bit
         +0x003 DebugActive      : UChar
         +0x003 ActiveDR7        : Pos 0, 1 Bit
         +0x003 Instrumented     : Pos 1, 1 Bit
         +0x003 Reserved2        : Pos 2, 4 Bits
         +0x003 UmsScheduled     : Pos 6, 1 Bit
         +0x003 UmsPrimary       : Pos 7, 1 Bit
         +0x003 DpcActive        : UChar
         +0x000 Lock             : Int4B
         +0x004 SignalState      : Int4B
         +0x008 WaitListHead     : _LIST_ENTRY
            +0x000 Flink            : Ptr64 
            +0x008 Blink            : Ptr64 
      +0x018 CycleTime        : Uint8B
      +0x020 QuantumTarget    : Uint8B
      +0x028 InitialStack     : Ptr64 
      +0x030 StackLimit       : Ptr64 
      +0x038 KernelStack      : Ptr64 
      +0x040 ThreadLock       : Uint8B
      +0x048 WaitRegister     : _KWAIT_STATUS_REGISTER
         +0x000 Flags            : UChar
         +0x000 State            : Pos 0, 2 Bits
         +0x000 Affinity         : Pos 2, 1 Bit
         +0x000 Priority         : Pos 3, 1 Bit
         +0x000 Apc              : Pos 4, 1 Bit
         +0x000 UserApc          : Pos 5, 1 Bit
         +0x000 Alert            : Pos 6, 1 Bit
         +0x000 Unused           : Pos 7, 1 Bit
      +0x049 Running          : UChar
      +0x04a Alerted          : UChar
      +0x04c KernelStackResident : Pos 0, 1 Bit
      +0x04c ReadyTransition  : Pos 1, 1 Bit
      +0x04c ProcessReadyQueue : Pos 2, 1 Bit
      +0x04c WaitNext         : Pos 3, 1 Bit
      +0x04c SystemAffinityActive : Pos 4, 1 Bit
      +0x04c Alertable        : Pos 5, 1 Bit
      +0x04c GdiFlushActive   : Pos 6, 1 Bit
      +0x04c UserStackWalkActive : Pos 7, 1 Bit
      +0x04c ApcInterruptRequest : Pos 8, 1 Bit
      +0x04c ForceDeferSchedule : Pos 9, 1 Bit
      +0x04c QuantumEndMigrate : Pos 10, 1 Bit
      +0x04c UmsDirectedSwitchEnable : Pos 11, 1 Bit
      +0x04c TimerActive      : Pos 12, 1 Bit
      +0x04c Reserved         : Pos 13, 19 Bits
      +0x04c MiscFlags        : Int4B
      +0x050 ApcState         : _KAPC_STATE
         +0x000 ApcListHead      : _LIST_ENTRY
            +0x000 Flink            : Ptr64 
            +0x008 Blink            : Ptr64 
         +0x020 Process          : Ptr64 
         +0x028 KernelApcInProgress : UChar
         +0x029 KernelApcPending : UChar
         +0x02a UserApcPending   : UChar
      +0x050 ApcStateFill     : UChar
      +0x07b Priority         : Char
      +0x07c NextProcessor    : Uint4B
      +0x080 DeferredProcessor : Uint4B
      +0x088 ApcQueueLock     : Uint8B
      +0x090 WaitStatus       : Int8B
      +0x098 WaitBlockList    : Ptr64 
      +0x0a0 WaitListEntry    : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
      +0x0a0 SwapListEntry    : _SINGLE_LIST_ENTRY
         +0x000 Next             : Ptr64 
      +0x0b0 Queue            : Ptr64 
      +0x0b8 Teb              : Ptr64 
      +0x0c0 Timer            : _KTIMER
         +0x000 Header           : _DISPATCHER_HEADER
            +0x000 Type             : UChar
            +0x001 TimerControlFlags : UChar
            +0x001 Absolute         : Pos 0, 1 Bit
            +0x001 Coalescable      : Pos 1, 1 Bit
            +0x001 KeepShifting     : Pos 2, 1 Bit
            +0x001 EncodedTolerableDelay : Pos 3, 5 Bits
            +0x001 Abandoned        : UChar
            +0x001 Signalling       : UChar
            +0x002 ThreadControlFlags : UChar
            +0x002 CpuThrottled     : Pos 0, 1 Bit
            +0x002 CycleProfiling   : Pos 1, 1 Bit
            +0x002 CounterProfiling : Pos 2, 1 Bit
            +0x002 Reserved         : Pos 3, 5 Bits
            +0x002 Hand             : UChar
            +0x002 Size             : UChar
            +0x003 TimerMiscFlags   : UChar
            +0x003 Index            : Pos 0, 6 Bits
            +0x003 Inserted         : Pos 6, 1 Bit
            +0x003 Expired          : Pos 7, 1 Bit
            +0x003 DebugActive      : UChar
            +0x003 ActiveDR7        : Pos 0, 1 Bit
            +0x003 Instrumented     : Pos 1, 1 Bit
            +0x003 Reserved2        : Pos 2, 4 Bits
            +0x003 UmsScheduled     : Pos 6, 1 Bit
            +0x003 UmsPrimary       : Pos 7, 1 Bit
            +0x003 DpcActive        : UChar
            +0x000 Lock             : Int4B
            +0x004 SignalState      : Int4B
            +0x008 WaitListHead     : _LIST_ENTRY
               +0x000 Flink            : Ptr64 
               +0x008 Blink            : Ptr64 
         +0x018 DueTime          : _ULARGE_INTEGER
            +0x000 LowPart          : Uint4B
            +0x004 HighPart         : Uint4B
            +0x000 u                : <unnamed-tag>
               +0x000 LowPart          : Uint4B
               +0x004 HighPart         : Uint4B
            +0x000 QuadPart         : Uint8B
         +0x020 TimerListEntry   : _LIST_ENTRY
            +0x000 Flink            : Ptr64 
            +0x008 Blink            : Ptr64 
         +0x030 Dpc              : Ptr64 
         +0x038 Processor        : Uint4B
         +0x03c Period           : Uint4B
      +0x100 AutoAlignment    : Pos 0, 1 Bit
      +0x100 DisableBoost     : Pos 1, 1 Bit
      +0x100 EtwStackTraceApc1Inserted : Pos 2, 1 Bit
      +0x100 EtwStackTraceApc2Inserted : Pos 3, 1 Bit
      +0x100 CalloutActive    : Pos 4, 1 Bit
      +0x100 ApcQueueable     : Pos 5, 1 Bit
      +0x100 EnableStackSwap  : Pos 6, 1 Bit
      +0x100 GuiThread        : Pos 7, 1 Bit
      +0x100 UmsPerformingSyscall : Pos 8, 1 Bit
      +0x100 ReservedFlags    : Pos 9, 23 Bits
      +0x100 ThreadFlags      : Int4B
      +0x104 Spare0           : Uint4B
      +0x108 WaitBlock        : _KWAIT_BLOCK
         +0x000 WaitListEntry    : _LIST_ENTRY
            +0x000 Flink            : Ptr64 
            +0x008 Blink            : Ptr64 
         +0x010 Thread           : Ptr64 
         +0x018 Object           : Ptr64 
         +0x020 NextWaitBlock    : Ptr64 
         +0x028 WaitKey          : Uint2B
         +0x02a WaitType         : UChar
         +0x02b BlockState       : UChar
         +0x02c SpareLong        : Int4B
      +0x108 WaitBlockFill4   : UChar
      +0x134 ContextSwitches  : Uint4B
      +0x108 WaitBlockFill5   : UChar
      +0x164 State            : UChar
      +0x165 NpxState         : Char
      +0x166 WaitIrql         : UChar
      +0x167 WaitMode         : Char
      +0x108 WaitBlockFill6   : UChar
      +0x194 WaitTime         : Uint4B
      +0x108 WaitBlockFill7   : UChar
      +0x1b0 TebMappedLowVa   : Ptr64 
      +0x1b8 Ucb              : Ptr64 
      +0x108 WaitBlockFill8   : UChar
      +0x1c4 KernelApcDisable : Int2B
      +0x1c6 SpecialApcDisable : Int2B
      +0x1c4 CombinedApcDisable : Uint4B
      +0x1c8 QueueListEntry   : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
      +0x1d8 TrapFrame        : Ptr64 
      +0x1e0 FirstArgument    : Ptr64 
      +0x1e8 CallbackStack    : Ptr64 
      +0x1e8 CallbackDepth    : Uint8B
      +0x1f0 ApcStateIndex    : UChar
      +0x1f1 BasePriority     : Char
      +0x1f2 PriorityDecrement : Char
      +0x1f2 ForegroundBoost  : Pos 0, 4 Bits
      +0x1f2 UnusualBoost     : Pos 4, 4 Bits
      +0x1f3 Preempted        : UChar
      +0x1f4 AdjustReason     : UChar
      +0x1f5 AdjustIncrement  : Char
      +0x1f6 PreviousMode     : Char
      +0x1f7 Saturation       : Char
      +0x1f8 SystemCallNumber : Uint4B
      +0x1fc FreezeCount      : Uint4B
      +0x200 UserAffinity     : _GROUP_AFFINITY
         +0x000 Mask             : Uint8B
         +0x008 Group            : Uint2B
         +0x00a Reserved         : Uint2B
      +0x210 Process          : Ptr64 
      +0x218 Affinity         : _GROUP_AFFINITY
         +0x000 Mask             : Uint8B
         +0x008 Group            : Uint2B
         +0x00a Reserved         : Uint2B
      +0x228 IdealProcessor   : Uint4B
      +0x22c UserIdealProcessor : Uint4B
      +0x230 ApcStatePointer  : Ptr64 
      +0x240 SavedApcState    : _KAPC_STATE
         +0x000 ApcListHead      : _LIST_ENTRY
            +0x000 Flink            : Ptr64 
            +0x008 Blink            : Ptr64 
         +0x020 Process          : Ptr64 
         +0x028 KernelApcInProgress : UChar
         +0x029 KernelApcPending : UChar
         +0x02a UserApcPending   : UChar
      +0x240 SavedApcStateFill : UChar
      +0x26b WaitReason       : UChar
      +0x26c SuspendCount     : Char
      +0x26d Spare1           : Char
      +0x26e CodePatchInProgress : UChar
      +0x270 Win32Thread      : Ptr64 
      +0x278 StackBase        : Ptr64 
      +0x280 SuspendApc       : _KAPC
         +0x000 Type             : UChar
         +0x001 SpareByte0       : UChar
         +0x002 Size             : UChar
         +0x003 SpareByte1       : UChar
         +0x004 SpareLong0       : Uint4B
         +0x008 Thread           : Ptr64 
         +0x010 ApcListEntry     : _LIST_ENTRY
            +0x000 Flink            : Ptr64 
            +0x008 Blink            : Ptr64 
         +0x020 KernelRoutine    : Ptr64 
         +0x028 RundownRoutine   : Ptr64 
         +0x030 NormalRoutine    : Ptr64 
         +0x038 NormalContext    : Ptr64 
         +0x040 SystemArgument1  : Ptr64 
         +0x048 SystemArgument2  : Ptr64 
         +0x050 ApcStateIndex    : Char
         +0x051 ApcMode          : Char
         +0x052 Inserted         : UChar
      +0x280 SuspendApcFill0  : UChar
      +0x281 ResourceIndex    : UChar
      +0x280 SuspendApcFill1  : UChar
      +0x283 QuantumReset     : UChar
      +0x280 SuspendApcFill2  : UChar
      +0x284 KernelTime       : Uint4B
      +0x280 SuspendApcFill3  : UChar
      +0x2c0 WaitPrcb         : Ptr64 
      +0x280 SuspendApcFill4  : UChar
      +0x2c8 LegoData         : Ptr64 
      +0x280 SuspendApcFill5  : UChar
      +0x2d3 LargeStack       : UChar
      +0x2d4 UserTime         : Uint4B
      +0x2d8 SuspendSemaphore : _KSEMAPHORE
         +0x000 Header           : _DISPATCHER_HEADER
            +0x000 Type             : UChar
            +0x001 TimerControlFlags : UChar
            +0x001 Absolute         : Pos 0, 1 Bit
            +0x001 Coalescable      : Pos 1, 1 Bit
            +0x001 KeepShifting     : Pos 2, 1 Bit
            +0x001 EncodedTolerableDelay : Pos 3, 5 Bits
            +0x001 Abandoned        : UChar
            +0x001 Signalling       : UChar
            +0x002 ThreadControlFlags : UChar
            +0x002 CpuThrottled     : Pos 0, 1 Bit
            +0x002 CycleProfiling   : Pos 1, 1 Bit
            +0x002 CounterProfiling : Pos 2, 1 Bit
            +0x002 Reserved         : Pos 3, 5 Bits
            +0x002 Hand             : UChar
            +0x002 Size             : UChar
            +0x003 TimerMiscFlags   : UChar
            +0x003 Index            : Pos 0, 6 Bits
            +0x003 Inserted         : Pos 6, 1 Bit
            +0x003 Expired          : Pos 7, 1 Bit
            +0x003 DebugActive      : UChar
            +0x003 ActiveDR7        : Pos 0, 1 Bit
            +0x003 Instrumented     : Pos 1, 1 Bit
            +0x003 Reserved2        : Pos 2, 4 Bits
            +0x003 UmsScheduled     : Pos 6, 1 Bit
            +0x003 UmsPrimary       : Pos 7, 1 Bit
            +0x003 DpcActive        : UChar
            +0x000 Lock             : Int4B
            +0x004 SignalState      : Int4B
            +0x008 WaitListHead     : _LIST_ENTRY
               +0x000 Flink            : Ptr64 
               +0x008 Blink            : Ptr64 
         +0x018 Limit            : Int4B
      +0x2d8 SuspendSemaphorefill : UChar
      +0x2f4 SListFaultCount  : Uint4B
      +0x2f8 ThreadListEntry  : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
      +0x308 MutantListHead   : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
      +0x318 SListFaultAddress : Ptr64 
      +0x320 ReadOperationCount : Int8B
      +0x328 WriteOperationCount : Int8B
      +0x330 OtherOperationCount : Int8B
      +0x338 ReadTransferCount : Int8B
      +0x340 WriteTransferCount : Int8B
      +0x348 OtherTransferCount : Int8B
      +0x350 ThreadCounters   : Ptr64 
      +0x358 XStateSave       : Ptr64 
   +0x360 CreateTime       : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x368 ExitTime         : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x368 KeyedWaitChain   : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x378 ExitStatus       : Int4B
   +0x380 PostBlockList    : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x380 ForwardLinkShadow : Ptr64 
   +0x388 StartAddress     : Ptr64 
   +0x390 TerminationPort  : Ptr64 
   +0x390 ReaperLink       : Ptr64 
   +0x390 KeyedWaitValue   : Ptr64 
   +0x398 ActiveTimerListLock : Uint8B
   +0x3a0 ActiveTimerListHead : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x3b0 Cid              : _CLIENT_ID
      +0x000 UniqueProcess    : Ptr64 
      +0x008 UniqueThread     : Ptr64 
   +0x3c0 KeyedWaitSemaphore : _KSEMAPHORE
      +0x000 Header           : _DISPATCHER_HEADER
         +0x000 Type             : UChar
         +0x001 TimerControlFlags : UChar
         +0x001 Absolute         : Pos 0, 1 Bit
         +0x001 Coalescable      : Pos 1, 1 Bit
         +0x001 KeepShifting     : Pos 2, 1 Bit
         +0x001 EncodedTolerableDelay : Pos 3, 5 Bits
         +0x001 Abandoned        : UChar
         +0x001 Signalling       : UChar
         +0x002 ThreadControlFlags : UChar
         +0x002 CpuThrottled     : Pos 0, 1 Bit
         +0x002 CycleProfiling   : Pos 1, 1 Bit
         +0x002 CounterProfiling : Pos 2, 1 Bit
         +0x002 Reserved         : Pos 3, 5 Bits
         +0x002 Hand             : UChar
         +0x002 Size             : UChar
         +0x003 TimerMiscFlags   : UChar
         +0x003 Index            : Pos 0, 6 Bits
         +0x003 Inserted         : Pos 6, 1 Bit
         +0x003 Expired          : Pos 7, 1 Bit
         +0x003 DebugActive      : UChar
         +0x003 ActiveDR7        : Pos 0, 1 Bit
         +0x003 Instrumented     : Pos 1, 1 Bit
         +0x003 Reserved2        : Pos 2, 4 Bits
         +0x003 UmsScheduled     : Pos 6, 1 Bit
         +0x003 UmsPrimary       : Pos 7, 1 Bit
         +0x003 DpcActive        : UChar
         +0x000 Lock             : Int4B
         +0x004 SignalState      : Int4B
         +0x008 WaitListHead     : _LIST_ENTRY
            +0x000 Flink            : Ptr64 
            +0x008 Blink            : Ptr64 
      +0x018 Limit            : Int4B
   +0x3c0 AlpcWaitSemaphore : _KSEMAPHORE
      +0x000 Header           : _DISPATCHER_HEADER
         +0x000 Type             : UChar
         +0x001 TimerControlFlags : UChar
         +0x001 Absolute         : Pos 0, 1 Bit
         +0x001 Coalescable      : Pos 1, 1 Bit
         +0x001 KeepShifting     : Pos 2, 1 Bit
         +0x001 EncodedTolerableDelay : Pos 3, 5 Bits
         +0x001 Abandoned        : UChar
         +0x001 Signalling       : UChar
         +0x002 ThreadControlFlags : UChar
         +0x002 CpuThrottled     : Pos 0, 1 Bit
         +0x002 CycleProfiling   : Pos 1, 1 Bit
         +0x002 CounterProfiling : Pos 2, 1 Bit
         +0x002 Reserved         : Pos 3, 5 Bits
         +0x002 Hand             : UChar
         +0x002 Size             : UChar
         +0x003 TimerMiscFlags   : UChar
         +0x003 Index            : Pos 0, 6 Bits
         +0x003 Inserted         : Pos 6, 1 Bit
         +0x003 Expired          : Pos 7, 1 Bit
         +0x003 DebugActive      : UChar
         +0x003 ActiveDR7        : Pos 0, 1 Bit
         +0x003 Instrumented     : Pos 1, 1 Bit
         +0x003 Reserved2        : Pos 2, 4 Bits
         +0x003 UmsScheduled     : Pos 6, 1 Bit
         +0x003 UmsPrimary       : Pos 7, 1 Bit
         +0x003 DpcActive        : UChar
         +0x000 Lock             : Int4B
         +0x004 SignalState      : Int4B
         +0x008 WaitListHead     : _LIST_ENTRY
            +0x000 Flink            : Ptr64 
            +0x008 Blink            : Ptr64 
      +0x018 Limit            : Int4B
   +0x3e0 ClientSecurity   : _PS_CLIENT_SECURITY_CONTEXT
      +0x000 ImpersonationData : Uint8B
      +0x000 ImpersonationToken : Ptr64 
      +0x000 ImpersonationLevel : Pos 0, 2 Bits
      +0x000 EffectiveOnly    : Pos 2, 1 Bit
   +0x3e8 IrpList          : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x3f8 TopLevelIrp      : Uint8B
   +0x400 DeviceToVerify   : Ptr64 
   +0x408 CpuQuotaApc      : Ptr64 
   +0x410 Win32StartAddress : Ptr64 
   +0x418 LegacyPowerObject : Ptr64 
   +0x420 ThreadListEntry  : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x430 RundownProtect   : _EX_RUNDOWN_REF
      +0x000 Count            : Uint8B
      +0x000 Ptr              : Ptr64 
   +0x438 ThreadLock       : _EX_PUSH_LOCK
      +0x000 Locked           : Pos 0, 1 Bit
      +0x000 Waiting          : Pos 1, 1 Bit
      +0x000 Waking           : Pos 2, 1 Bit
      +0x000 MultipleShared   : Pos 3, 1 Bit
      +0x000 Shared           : Pos 4, 60 Bits
      +0x000 Value            : Uint8B
      +0x000 Ptr              : Ptr64 
   +0x440 ReadClusterSize  : Uint4B
   +0x444 MmLockOrdering   : Int4B
   +0x448 CrossThreadFlags : Uint4B
   +0x448 Terminated       : Pos 0, 1 Bit
   +0x448 ThreadInserted   : Pos 1, 1 Bit
   +0x448 HideFromDebugger : Pos 2, 1 Bit
   +0x448 ActiveImpersonationInfo : Pos 3, 1 Bit
   +0x448 SystemThread     : Pos 4, 1 Bit
   +0x448 HardErrorsAreDisabled : Pos 5, 1 Bit
   +0x448 BreakOnTermination : Pos 6, 1 Bit
   +0x448 SkipCreationMsg  : Pos 7, 1 Bit
   +0x448 SkipTerminationMsg : Pos 8, 1 Bit
   +0x448 CopyTokenOnOpen  : Pos 9, 1 Bit
   +0x448 ThreadIoPriority : Pos 10, 3 Bits
   +0x448 ThreadPagePriority : Pos 13, 3 Bits
   +0x448 RundownFail      : Pos 16, 1 Bit
   +0x448 NeedsWorkingSetAging : Pos 17, 1 Bit
   +0x44c SameThreadPassiveFlags : Uint4B
   +0x44c ActiveExWorker   : Pos 0, 1 Bit
   +0x44c ExWorkerCanWaitUser : Pos 1, 1 Bit
   +0x44c MemoryMaker      : Pos 2, 1 Bit
   +0x44c ClonedThread     : Pos 3, 1 Bit
   +0x44c KeyedEventInUse  : Pos 4, 1 Bit
   +0x44c RateApcState     : Pos 5, 2 Bits
   +0x44c SelfTerminate    : Pos 7, 1 Bit
   +0x450 SameThreadApcFlags : Uint4B
   +0x450 Spare            : Pos 0, 1 Bit
   +0x450 StartAddressInvalid : Pos 1, 1 Bit
   +0x450 EtwPageFaultCalloutActive : Pos 2, 1 Bit
   +0x450 OwnsProcessWorkingSetExclusive : Pos 3, 1 Bit
   +0x450 OwnsProcessWorkingSetShared : Pos 4, 1 Bit
   +0x450 OwnsSystemCacheWorkingSetExclusive : Pos 5, 1 Bit
   +0x450 OwnsSystemCacheWorkingSetShared : Pos 6, 1 Bit
   +0x450 OwnsSessionWorkingSetExclusive : Pos 7, 1 Bit
   +0x451 OwnsSessionWorkingSetShared : Pos 0, 1 Bit
   +0x451 OwnsProcessAddressSpaceExclusive : Pos 1, 1 Bit
   +0x451 OwnsProcessAddressSpaceShared : Pos 2, 1 Bit
   +0x451 SuppressSymbolLoad : Pos 3, 1 Bit
   +0x451 Prefetching      : Pos 4, 1 Bit
   +0x451 OwnsDynamicMemoryShared : Pos 5, 1 Bit
   +0x451 OwnsChangeControlAreaExclusive : Pos 6, 1 Bit
   +0x451 OwnsChangeControlAreaShared : Pos 7, 1 Bit
   +0x452 OwnsPagedPoolWorkingSetExclusive : Pos 0, 1 Bit
   +0x452 OwnsPagedPoolWorkingSetShared : Pos 1, 1 Bit
   +0x452 OwnsSystemPtesWorkingSetExclusive : Pos 2, 1 Bit
   +0x452 OwnsSystemPtesWorkingSetShared : Pos 3, 1 Bit
   +0x452 TrimTrigger      : Pos 4, 2 Bits
   +0x452 Spare1           : Pos 6, 2 Bits
   +0x453 PriorityRegionActive : UChar
   +0x454 CacheManagerActive : UChar
   +0x455 DisablePageFaultClustering : UChar
   +0x456 ActiveFaultCount : UChar
   +0x457 LockOrderState   : UChar
   +0x458 AlpcMessageId    : Uint8B
   +0x460 AlpcMessage      : Ptr64 
   +0x460 AlpcReceiveAttributeSet : Uint4B
   +0x468 AlpcWaitListEntry : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x478 CacheManagerCount : Uint4B
   +0x47c IoBoostCount     : Uint4B
   +0x480 IrpListLock      : Uint8B
   +0x488 ReservedForSynchTracking : Ptr64 
   +0x490 CmCallbackListHead : _SINGLE_LIST_ENTRY
      +0x000 Next             : Ptr64 
kd> dt -b _EPROCESS
nt!_EPROCESS
   +0x000 Pcb              : _KPROCESS
      +0x000 Header           : _DISPATCHER_HEADER
         +0x000 Type             : UChar
         +0x001 TimerControlFlags : UChar
         +0x001 Absolute         : Pos 0, 1 Bit
         +0x001 Coalescable      : Pos 1, 1 Bit
         +0x001 KeepShifting     : Pos 2, 1 Bit
         +0x001 EncodedTolerableDelay : Pos 3, 5 Bits
         +0x001 Abandoned        : UChar
         +0x001 Signalling       : UChar
         +0x002 ThreadControlFlags : UChar
         +0x002 CpuThrottled     : Pos 0, 1 Bit
         +0x002 CycleProfiling   : Pos 1, 1 Bit
         +0x002 CounterProfiling : Pos 2, 1 Bit
         +0x002 Reserved         : Pos 3, 5 Bits
         +0x002 Hand             : UChar
         +0x002 Size             : UChar
         +0x003 TimerMiscFlags   : UChar
         +0x003 Index            : Pos 0, 6 Bits
         +0x003 Inserted         : Pos 6, 1 Bit
         +0x003 Expired          : Pos 7, 1 Bit
         +0x003 DebugActive      : UChar
         +0x003 ActiveDR7        : Pos 0, 1 Bit
         +0x003 Instrumented     : Pos 1, 1 Bit
         +0x003 Reserved2        : Pos 2, 4 Bits
         +0x003 UmsScheduled     : Pos 6, 1 Bit
         +0x003 UmsPrimary       : Pos 7, 1 Bit
         +0x003 DpcActive        : UChar
         +0x000 Lock             : Int4B
         +0x004 SignalState      : Int4B
         +0x008 WaitListHead     : _LIST_ENTRY
            +0x000 Flink            : Ptr64 
            +0x008 Blink            : Ptr64 
      +0x018 ProfileListHead  : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
      +0x028 DirectoryTableBase : Uint8B
      +0x030 ThreadListHead   : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
      +0x040 ProcessLock      : Uint8B
      +0x048 Affinity         : _KAFFINITY_EX
         +0x000 Count            : Uint2B
         +0x002 Size             : Uint2B
         +0x004 Reserved         : Uint4B
         +0x008 Bitmap           : Uint8B
      +0x070 ReadyListHead    : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
      +0x080 SwapListEntry    : _SINGLE_LIST_ENTRY
         +0x000 Next             : Ptr64 
      +0x088 ActiveProcessors : _KAFFINITY_EX
         +0x000 Count            : Uint2B
         +0x002 Size             : Uint2B
         +0x004 Reserved         : Uint4B
         +0x008 Bitmap           : Uint8B
      +0x0b0 AutoAlignment    : Pos 0, 1 Bit
      +0x0b0 DisableBoost     : Pos 1, 1 Bit
      +0x0b0 DisableQuantum   : Pos 2, 1 Bit
      +0x0b0 ActiveGroupsMask : Pos 3, 4 Bits
      +0x0b0 ReservedFlags    : Pos 7, 25 Bits
      +0x0b0 ProcessFlags     : Int4B
      +0x0b4 BasePriority     : Char
      +0x0b5 QuantumReset     : Char
      +0x0b6 Visited          : UChar
      +0x0b7 Unused3          : UChar
      +0x0b8 ThreadSeed       : Uint4B
      +0x0c8 IdealNode        : Uint2B
      +0x0d0 IdealGlobalNode  : Uint2B
      +0x0d2 Flags            : _KEXECUTE_OPTIONS
         +0x000 ExecuteDisable   : Pos 0, 1 Bit
         +0x000 ExecuteEnable    : Pos 1, 1 Bit
         +0x000 DisableThunkEmulation : Pos 2, 1 Bit
         +0x000 Permanent        : Pos 3, 1 Bit
         +0x000 ExecuteDispatchEnable : Pos 4, 1 Bit
         +0x000 ImageDispatchEnable : Pos 5, 1 Bit
         +0x000 DisableExceptionChainValidation : Pos 6, 1 Bit
         +0x000 Spare            : Pos 7, 1 Bit
         +0x000 ExecuteOptions   : UChar
      +0x0d3 Unused1          : UChar
      +0x0d4 Unused2          : Uint4B
      +0x0d8 Unused4          : Uint4B
      +0x0dc StackCount       : _KSTACK_COUNT
         +0x000 Value            : Int4B
         +0x000 State            : Pos 0, 3 Bits
         +0x000 StackCount       : Pos 3, 29 Bits
      +0x0e0 ProcessListEntry : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
      +0x0f0 CycleTime        : Uint8B
      +0x0f8 KernelTime       : Uint4B
      +0x0fc UserTime         : Uint4B
      +0x100 InstrumentationCallback : Ptr64 
      +0x108 LdtSystemDescriptor : _KGDTENTRY64
         +0x000 LimitLow         : Uint2B
         +0x002 BaseLow          : Uint2B
         +0x004 Bytes            : <unnamed-tag>
            +0x000 BaseMiddle       : UChar
            +0x001 Flags1           : UChar
            +0x002 Flags2           : UChar
            +0x003 BaseHigh         : UChar
         +0x004 Bits             : <unnamed-tag>
            +0x000 BaseMiddle       : Pos 0, 8 Bits
            +0x000 Type             : Pos 8, 5 Bits
            +0x000 Dpl              : Pos 13, 2 Bits
            +0x000 Present          : Pos 15, 1 Bit
            +0x000 LimitHigh        : Pos 16, 4 Bits
            +0x000 System           : Pos 20, 1 Bit
            +0x000 LongMode         : Pos 21, 1 Bit
            +0x000 DefaultBig       : Pos 22, 1 Bit
            +0x000 Granularity      : Pos 23, 1 Bit
            +0x000 BaseHigh         : Pos 24, 8 Bits
         +0x008 BaseUpper        : Uint4B
         +0x00c MustBeZero       : Uint4B
         +0x000 Alignment        : Uint8B
      +0x118 LdtBaseAddress   : Ptr64 
      +0x120 LdtProcessLock   : _KGUARDED_MUTEX
         +0x000 Count            : Int4B
         +0x008 Owner            : Ptr64 
         +0x010 Contention       : Uint4B
         +0x018 Gate             : _KGATE
            +0x000 Header           : _DISPATCHER_HEADER
               +0x000 Type             : UChar
               +0x001 TimerControlFlags : UChar
               +0x001 Absolute         : Pos 0, 1 Bit
               +0x001 Coalescable      : Pos 1, 1 Bit
               +0x001 KeepShifting     : Pos 2, 1 Bit
               +0x001 EncodedTolerableDelay : Pos 3, 5 Bits
               +0x001 Abandoned        : UChar
               +0x001 Signalling       : UChar
               +0x002 ThreadControlFlags : UChar
               +0x002 CpuThrottled     : Pos 0, 1 Bit
               +0x002 CycleProfiling   : Pos 1, 1 Bit
               +0x002 CounterProfiling : Pos 2, 1 Bit
               +0x002 Reserved         : Pos 3, 5 Bits
               +0x002 Hand             : UChar
               +0x002 Size             : UChar
               +0x003 TimerMiscFlags   : UChar
               +0x003 Index            : Pos 0, 6 Bits
               +0x003 Inserted         : Pos 6, 1 Bit
               +0x003 Expired          : Pos 7, 1 Bit
               +0x003 DebugActive      : UChar
               +0x003 ActiveDR7        : Pos 0, 1 Bit
               +0x003 Instrumented     : Pos 1, 1 Bit
               +0x003 Reserved2        : Pos 2, 4 Bits
               +0x003 UmsScheduled     : Pos 6, 1 Bit
               +0x003 UmsPrimary       : Pos 7, 1 Bit
               +0x003 DpcActive        : UChar
               +0x000 Lock             : Int4B
               +0x004 SignalState      : Int4B
               +0x008 WaitListHead     : _LIST_ENTRY
                  +0x000 Flink            : Ptr64 
                  +0x008 Blink            : Ptr64 
         +0x030 KernelApcDisable : Int2B
         +0x032 SpecialApcDisable : Int2B
         +0x030 CombinedApcDisable : Uint4B
      +0x158 LdtFreeSelectorHint : Uint2B
      +0x15a LdtTableLength   : Uint2B
   +0x160 ProcessLock      : _EX_PUSH_LOCK
      +0x000 Locked           : Pos 0, 1 Bit
      +0x000 Waiting          : Pos 1, 1 Bit
      +0x000 Waking           : Pos 2, 1 Bit
      +0x000 MultipleShared   : Pos 3, 1 Bit
      +0x000 Shared           : Pos 4, 60 Bits
      +0x000 Value            : Uint8B
      +0x000 Ptr              : Ptr64 
   +0x168 CreateTime       : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x170 ExitTime         : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x178 RundownProtect   : _EX_RUNDOWN_REF
      +0x000 Count            : Uint8B
      +0x000 Ptr              : Ptr64 
   +0x180 UniqueProcessId  : Ptr64 
   +0x188 ActiveProcessLinks : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x198 ProcessQuotaUsage : Uint8B
   +0x1a8 ProcessQuotaPeak : Uint8B
   +0x1b8 CommitCharge     : Uint8B
   +0x1c0 QuotaBlock       : Ptr64 
   +0x1c8 CpuQuotaBlock    : Ptr64 
   +0x1d0 PeakVirtualSize  : Uint8B
   +0x1d8 VirtualSize      : Uint8B
   +0x1e0 SessionProcessLinks : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x1f0 DebugPort        : Ptr64 
   +0x1f8 ExceptionPortData : Ptr64 
   +0x1f8 ExceptionPortValue : Uint8B
   +0x1f8 ExceptionPortState : Pos 0, 3 Bits
   +0x200 ObjectTable      : Ptr64 
   +0x208 Token            : _EX_FAST_REF
      +0x000 Object           : Ptr64 
      +0x000 RefCnt           : Pos 0, 4 Bits
      +0x000 Value            : Uint8B
   +0x210 WorkingSetPage   : Uint8B
   +0x218 AddressCreationLock : _EX_PUSH_LOCK
      +0x000 Locked           : Pos 0, 1 Bit
      +0x000 Waiting          : Pos 1, 1 Bit
      +0x000 Waking           : Pos 2, 1 Bit
      +0x000 MultipleShared   : Pos 3, 1 Bit
      +0x000 Shared           : Pos 4, 60 Bits
      +0x000 Value            : Uint8B
      +0x000 Ptr              : Ptr64 
   +0x220 RotateInProgress : Ptr64 
   +0x228 ForkInProgress   : Ptr64 
   +0x230 HardwareTrigger  : Uint8B
   +0x238 PhysicalVadRoot  : Ptr64 
   +0x240 CloneRoot        : Ptr64 
   +0x248 NumberOfPrivatePages : Uint8B
   +0x250 NumberOfLockedPages : Uint8B
   +0x258 Win32Process     : Ptr64 
   +0x260 Job              : Ptr64 
   +0x268 SectionObject    : Ptr64 
   +0x270 SectionBaseAddress : Ptr64 
   +0x278 Cookie           : Uint4B
   +0x27c UmsScheduledThreads : Uint4B
   +0x280 WorkingSetWatch  : Ptr64 
   +0x288 Win32WindowStation : Ptr64 
   +0x290 InheritedFromUniqueProcessId : Ptr64 
   +0x298 LdtInformation   : Ptr64 
   +0x2a0 Spare            : Ptr64 
   +0x2a8 ConsoleHostProcess : Uint8B
   +0x2b0 DeviceMap        : Ptr64 
   +0x2b8 EtwDataSource    : Ptr64 
   +0x2c0 FreeTebHint      : Ptr64 
   +0x2c8 FreeUmsTebHint   : Ptr64 
   +0x2d0 PageDirectoryPte : _HARDWARE_PTE
      +0x000 Valid            : Pos 0, 1 Bit
      +0x000 Write            : Pos 1, 1 Bit
      +0x000 Owner            : Pos 2, 1 Bit
      +0x000 WriteThrough     : Pos 3, 1 Bit
      +0x000 CacheDisable     : Pos 4, 1 Bit
      +0x000 Accessed         : Pos 5, 1 Bit
      +0x000 Dirty            : Pos 6, 1 Bit
      +0x000 LargePage        : Pos 7, 1 Bit
      +0x000 Global           : Pos 8, 1 Bit
      +0x000 CopyOnWrite      : Pos 9, 1 Bit
      +0x000 Prototype        : Pos 10, 1 Bit
      +0x000 reserved0        : Pos 11, 1 Bit
      +0x000 PageFrameNumber  : Pos 12, 28 Bits
      +0x000 reserved1        : Pos 40, 12 Bits
      +0x000 SoftwareWsIndex  : Pos 52, 11 Bits
      +0x000 NoExecute        : Pos 63, 1 Bit
   +0x2d0 Filler           : Uint8B
   +0x2d8 Session          : Ptr64 
   +0x2e0 ImageFileName    : UChar
   +0x2ef PriorityClass    : UChar
   +0x2f0 JobLinks         : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x300 LockedPagesList  : Ptr64 
   +0x308 ThreadListHead   : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x318 SecurityPort     : Ptr64 
   +0x320 Wow64Process     : Ptr64 
   +0x328 ActiveThreads    : Uint4B
   +0x32c ImagePathHash    : Uint4B
   +0x330 DefaultHardErrorProcessing : Uint4B
   +0x334 LastThreadExitStatus : Int4B
   +0x338 Peb              : Ptr64 
   +0x340 PrefetchTrace    : _EX_FAST_REF
      +0x000 Object           : Ptr64 
      +0x000 RefCnt           : Pos 0, 4 Bits
      +0x000 Value            : Uint8B
   +0x348 ReadOperationCount : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x350 WriteOperationCount : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x358 OtherOperationCount : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x360 ReadTransferCount : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x368 WriteTransferCount : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x370 OtherTransferCount : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x378 CommitChargeLimit : Uint8B
   +0x380 CommitChargePeak : Uint8B
   +0x388 AweInfo          : Ptr64 
   +0x390 SeAuditProcessCreationInfo : _SE_AUDIT_PROCESS_CREATION_INFO
      +0x000 ImageFileName    : Ptr64 
   +0x398 Vm               : _MMSUPPORT
      +0x000 WorkingSetMutex  : _EX_PUSH_LOCK
         +0x000 Locked           : Pos 0, 1 Bit
         +0x000 Waiting          : Pos 1, 1 Bit
         +0x000 Waking           : Pos 2, 1 Bit
         +0x000 MultipleShared   : Pos 3, 1 Bit
         +0x000 Shared           : Pos 4, 60 Bits
         +0x000 Value            : Uint8B
         +0x000 Ptr              : Ptr64 
      +0x008 ExitGate         : Ptr64 
      +0x010 AccessLog        : Ptr64 
      +0x018 WorkingSetExpansionLinks : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
      +0x028 AgeDistribution  : Uint4B
      +0x044 MinimumWorkingSetSize : Uint4B
      +0x048 WorkingSetSize   : Uint4B
      +0x04c WorkingSetPrivateSize : Uint4B
      +0x050 MaximumWorkingSetSize : Uint4B
      +0x054 ChargedWslePages : Uint4B
      +0x058 ActualWslePages  : Uint4B
      +0x05c WorkingSetSizeOverhead : Uint4B
      +0x060 PeakWorkingSetSize : Uint4B
      +0x064 HardFaultCount   : Uint4B
      +0x068 VmWorkingSetList : Ptr64 
      +0x070 NextPageColor    : Uint2B
      +0x072 LastTrimStamp    : Uint2B
      +0x074 PageFaultCount   : Uint4B
      +0x078 RepurposeCount   : Uint4B
      +0x07c Spare            : Uint4B
      +0x084 Flags            : _MMSUPPORT_FLAGS
         +0x000 WorkingSetType   : Pos 0, 3 Bits
         +0x000 ModwriterAttached : Pos 3, 1 Bit
         +0x000 TrimHard         : Pos 4, 1 Bit
         +0x000 MaximumWorkingSetHard : Pos 5, 1 Bit
         +0x000 ForceTrim        : Pos 6, 1 Bit
         +0x000 MinimumWorkingSetHard : Pos 7, 1 Bit
         +0x001 SessionMaster    : Pos 0, 1 Bit
         +0x001 TrimmerState     : Pos 1, 2 Bits
         +0x001 Reserved         : Pos 3, 1 Bit
         +0x001 PageStealers     : Pos 4, 4 Bits
         +0x002 MemoryPriority   : Pos 0, 8 Bits
         +0x003 WsleDeleted      : Pos 0, 1 Bit
         +0x003 VmExiting        : Pos 1, 1 Bit
         +0x003 ExpansionFailed  : Pos 2, 1 Bit
         +0x003 Available        : Pos 3, 5 Bits
   +0x420 MmProcessLinks   : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x430 HighestUserAddress : Ptr64 
   +0x438 ModifiedPageCount : Uint4B
   +0x43c Flags2           : Uint4B
   +0x43c JobNotReallyActive : Pos 0, 1 Bit
   +0x43c AccountingFolded : Pos 1, 1 Bit
   +0x43c NewProcessReported : Pos 2, 1 Bit
   +0x43c ExitProcessReported : Pos 3, 1 Bit
   +0x43c ReportCommitChanges : Pos 4, 1 Bit
   +0x43c LastReportMemory : Pos 5, 1 Bit
   +0x43c ReportPhysicalPageChanges : Pos 6, 1 Bit
   +0x43c HandleTableRundown : Pos 7, 1 Bit
   +0x43c NeedsHandleRundown : Pos 8, 1 Bit
   +0x43c RefTraceEnabled  : Pos 9, 1 Bit
   +0x43c NumaAware        : Pos 10, 1 Bit
   +0x43c ProtectedProcess : Pos 11, 1 Bit
   +0x43c DefaultPagePriority : Pos 12, 3 Bits
   +0x43c PrimaryTokenFrozen : Pos 15, 1 Bit
   +0x43c ProcessVerifierTarget : Pos 16, 1 Bit
   +0x43c StackRandomizationDisabled : Pos 17, 1 Bit
   +0x43c AffinityPermanent : Pos 18, 1 Bit
   +0x43c AffinityUpdateEnable : Pos 19, 1 Bit
   +0x43c PropagateNode    : Pos 20, 1 Bit
   +0x43c ExplicitAffinity : Pos 21, 1 Bit
   +0x440 Flags            : Uint4B
   +0x440 CreateReported   : Pos 0, 1 Bit
   +0x440 NoDebugInherit   : Pos 1, 1 Bit
   +0x440 ProcessExiting   : Pos 2, 1 Bit
   +0x440 ProcessDelete    : Pos 3, 1 Bit
   +0x440 Wow64SplitPages  : Pos 4, 1 Bit
   +0x440 VmDeleted        : Pos 5, 1 Bit
   +0x440 OutswapEnabled   : Pos 6, 1 Bit
   +0x440 Outswapped       : Pos 7, 1 Bit
   +0x440 ForkFailed       : Pos 8, 1 Bit
   +0x440 Wow64VaSpace4Gb  : Pos 9, 1 Bit
   +0x440 AddressSpaceInitialized : Pos 10, 2 Bits
   +0x440 SetTimerResolution : Pos 12, 1 Bit
   +0x440 BreakOnTermination : Pos 13, 1 Bit
   +0x440 DeprioritizeViews : Pos 14, 1 Bit
   +0x440 WriteWatch       : Pos 15, 1 Bit
   +0x440 ProcessInSession : Pos 16, 1 Bit
   +0x440 OverrideAddressSpace : Pos 17, 1 Bit
   +0x440 HasAddressSpace  : Pos 18, 1 Bit
   +0x440 LaunchPrefetched : Pos 19, 1 Bit
   +0x440 InjectInpageErrors : Pos 20, 1 Bit
   +0x440 VmTopDown        : Pos 21, 1 Bit
   +0x440 ImageNotifyDone  : Pos 22, 1 Bit
   +0x440 PdeUpdateNeeded  : Pos 23, 1 Bit
   +0x440 VdmAllowed       : Pos 24, 1 Bit
   +0x440 CrossSessionCreate : Pos 25, 1 Bit
   +0x440 ProcessInserted  : Pos 26, 1 Bit
   +0x440 DefaultIoPriority : Pos 27, 3 Bits
   +0x440 ProcessSelfDelete : Pos 30, 1 Bit
   +0x440 SetTimerResolutionLink : Pos 31, 1 Bit
   +0x444 ExitStatus       : Int4B
   +0x448 VadRoot          : _MM_AVL_TABLE
      +0x000 BalancedRoot     : _MMADDRESS_NODE
         +0x000 u1               : <unnamed-tag>
            +0x000 Balance          : Pos 0, 2 Bits
            +0x000 Parent           : Ptr64 
         +0x008 LeftChild        : Ptr64 
         +0x010 RightChild       : Ptr64 
         +0x018 StartingVpn      : Uint8B
         +0x020 EndingVpn        : Uint8B
      +0x028 DepthOfTree      : Pos 0, 5 Bits
      +0x028 Unused           : Pos 5, 3 Bits
      +0x028 NumberGenericTableElements : Pos 8, 56 Bits
      +0x030 NodeHint         : Ptr64 
      +0x038 NodeFreeHint     : Ptr64 
   +0x488 AlpcContext      : _ALPC_PROCESS_CONTEXT
      +0x000 Lock             : _EX_PUSH_LOCK
         +0x000 Locked           : Pos 0, 1 Bit
         +0x000 Waiting          : Pos 1, 1 Bit
         +0x000 Waking           : Pos 2, 1 Bit
         +0x000 MultipleShared   : Pos 3, 1 Bit
         +0x000 Shared           : Pos 4, 60 Bits
         +0x000 Value            : Uint8B
         +0x000 Ptr              : Ptr64 
      +0x008 ViewListHead     : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
      +0x018 PagedPoolQuotaCache : Uint8B
   +0x4a8 TimerResolutionLink : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x4b8 RequestedTimerResolution : Uint4B
   +0x4bc ActiveThreadsHighWatermark : Uint4B
   +0x4c0 SmallestTimerResolution : Uint4B
   +0x4c8 TimerResolutionStackRecord : Ptr64 
kd> dt -b _PEB
nt!_PEB
   +0x000 InheritedAddressSpace : UChar
   +0x001 ReadImageFileExecOptions : UChar
   +0x002 BeingDebugged    : UChar
   +0x003 BitField         : UChar
   +0x003 ImageUsesLargePages : Pos 0, 1 Bit
   +0x003 IsProtectedProcess : Pos 1, 1 Bit
   +0x003 IsLegacyProcess  : Pos 2, 1 Bit
   +0x003 IsImageDynamicallyRelocated : Pos 3, 1 Bit
   +0x003 SkipPatchingUser32Forwarders : Pos 4, 1 Bit
   +0x003 SpareBits        : Pos 5, 3 Bits
   +0x008 Mutant           : Ptr64 
   +0x010 ImageBaseAddress : Ptr64 
   +0x018 Ldr              : Ptr64 
   +0x020 ProcessParameters : Ptr64 
   +0x028 SubSystemData    : Ptr64 
   +0x030 ProcessHeap      : Ptr64 
   +0x038 FastPebLock      : Ptr64 
   +0x040 AtlThunkSListPtr : Ptr64 
   +0x048 IFEOKey          : Ptr64 
   +0x050 CrossProcessFlags : Uint4B
   +0x050 ProcessInJob     : Pos 0, 1 Bit
   +0x050 ProcessInitializing : Pos 1, 1 Bit
   +0x050 ProcessUsingVEH  : Pos 2, 1 Bit
   +0x050 ProcessUsingVCH  : Pos 3, 1 Bit
   +0x050 ProcessUsingFTH  : Pos 4, 1 Bit
   +0x050 ReservedBits0    : Pos 5, 27 Bits
   +0x058 KernelCallbackTable : Ptr64 
   +0x058 UserSharedInfoPtr : Ptr64 
   +0x060 SystemReserved   : Uint4B
   +0x064 AtlThunkSListPtr32 : Uint4B
   +0x068 ApiSetMap        : Ptr64 
   +0x070 TlsExpansionCounter : Uint4B
   +0x078 TlsBitmap        : Ptr64 
   +0x080 TlsBitmapBits    : Uint4B
   +0x088 ReadOnlySharedMemoryBase : Ptr64 
   +0x090 HotpatchInformation : Ptr64 
   +0x098 ReadOnlyStaticServerData : Ptr64 
   +0x0a0 AnsiCodePageData : Ptr64 
   +0x0a8 OemCodePageData  : Ptr64 
   +0x0b0 UnicodeCaseTableData : Ptr64 
   +0x0b8 NumberOfProcessors : Uint4B
   +0x0bc NtGlobalFlag     : Uint4B
   +0x0c0 CriticalSectionTimeout : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x0c8 HeapSegmentReserve : Uint8B
   +0x0d0 HeapSegmentCommit : Uint8B
   +0x0d8 HeapDeCommitTotalFreeThreshold : Uint8B
   +0x0e0 HeapDeCommitFreeBlockThreshold : Uint8B
   +0x0e8 NumberOfHeaps    : Uint4B
   +0x0ec MaximumNumberOfHeaps : Uint4B
   +0x0f0 ProcessHeaps     : Ptr64 
   +0x0f8 GdiSharedHandleTable : Ptr64 
   +0x100 ProcessStarterHelper : Ptr64 
   +0x108 GdiDCAttributeList : Uint4B
   +0x110 LoaderLock       : Ptr64 
   +0x118 OSMajorVersion   : Uint4B
   +0x11c OSMinorVersion   : Uint4B
   +0x120 OSBuildNumber    : Uint2B
   +0x122 OSCSDVersion     : Uint2B
   +0x124 OSPlatformId     : Uint4B
   +0x128 ImageSubsystem   : Uint4B
   +0x12c ImageSubsystemMajorVersion : Uint4B
   +0x130 ImageSubsystemMinorVersion : Uint4B
   +0x138 ActiveProcessAffinityMask : Uint8B
   +0x140 GdiHandleBuffer  : Uint4B
   +0x230 PostProcessInitRoutine : Ptr64 
   +0x238 TlsExpansionBitmap : Ptr64 
   +0x240 TlsExpansionBitmapBits : Uint4B
   +0x2c0 SessionId        : Uint4B
   +0x2c8 AppCompatFlags   : _ULARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Uint4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Uint4B
      +0x000 QuadPart         : Uint8B
   +0x2d0 AppCompatFlagsUser : _ULARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Uint4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Uint4B
      +0x000 QuadPart         : Uint8B
   +0x2d8 pShimData        : Ptr64 
   +0x2e0 AppCompatInfo    : Ptr64 
   +0x2e8 CSDVersion       : _UNICODE_STRING
      +0x000 Length           : Uint2B
      +0x002 MaximumLength    : Uint2B
      +0x008 Buffer           : Ptr64 
   +0x2f8 ActivationContextData : Ptr64 
   +0x300 ProcessAssemblyStorageMap : Ptr64 
   +0x308 SystemDefaultActivationContextData : Ptr64 
   +0x310 SystemAssemblyStorageMap : Ptr64 
   +0x318 MinimumStackCommit : Uint8B
   +0x320 FlsCallback      : Ptr64 
   +0x328 FlsListHead      : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x338 FlsBitmap        : Ptr64 
   +0x340 FlsBitmapBits    : Uint4B
   +0x350 FlsHighIndex     : Uint4B
   +0x358 WerRegistrationData : Ptr64 
   +0x360 WerShipAssertPtr : Ptr64 
   +0x368 pContextData     : Ptr64 
   +0x370 pImageHeaderHash : Ptr64 
   +0x378 TracingFlags     : Uint4B
   +0x378 HeapTracingEnabled : Pos 0, 1 Bit
   +0x378 CritSecTracingEnabled : Pos 1, 1 Bit
   +0x378 SpareTracingBits : Pos 2, 30 Bits
kd> dt -t _TEB
nt!_TEB
   +0x000 NtTib            : _NT_TIB
   +0x038 EnvironmentPointer : Ptr64 Void
   +0x040 ClientId         : _CLIENT_ID
   +0x050 ActiveRpcHandle  : Ptr64 Void
   +0x058 ThreadLocalStoragePointer : Ptr64 Void
   +0x060 ProcessEnvironmentBlock : Ptr64 _PEB
   +0x068 LastErrorValue   : Uint4B
   +0x06c CountOfOwnedCriticalSections : Uint4B
   +0x070 CsrClientThread  : Ptr64 Void
   +0x078 Win32ThreadInfo  : Ptr64 Void
   +0x080 User32Reserved   : [26] Uint4B
   +0x0e8 UserReserved     : [5] Uint4B
   +0x100 WOW32Reserved    : Ptr64 Void
   +0x108 CurrentLocale    : Uint4B
   +0x10c FpSoftwareStatusRegister : Uint4B
   +0x110 SystemReserved1  : [54] Ptr64 Void
   +0x2c0 ExceptionCode    : Int4B
   +0x2c8 ActivationContextStackPointer : Ptr64 _ACTIVATION_CONTEXT_STACK
   +0x2d0 SpareBytes       : [24] UChar
   +0x2e8 TxFsContext      : Uint4B
   +0x2f0 GdiTebBatch      : _GDI_TEB_BATCH
   +0x7d8 RealClientId     : _CLIENT_ID
   +0x7e8 GdiCachedProcessHandle : Ptr64 Void
   +0x7f0 GdiClientPID     : Uint4B
   +0x7f4 GdiClientTID     : Uint4B
   +0x7f8 GdiThreadLocalInfo : Ptr64 Void
   +0x800 Win32ClientInfo  : [62] Uint8B
   +0x9f0 glDispatchTable  : [233] Ptr64 Void
   +0x1138 glReserved1      : [29] Uint8B
   +0x1220 glReserved2      : Ptr64 Void
   +0x1228 glSectionInfo    : Ptr64 Void
   +0x1230 glSection        : Ptr64 Void
   +0x1238 glTable          : Ptr64 Void
   +0x1240 glCurrentRC      : Ptr64 Void
   +0x1248 glContext        : Ptr64 Void
   +0x1250 LastStatusValue  : Uint4B
   +0x1258 StaticUnicodeString : _UNICODE_STRING
   +0x1268 StaticUnicodeBuffer : [261] Wchar
   +0x1478 DeallocationStack : Ptr64 Void
   +0x1480 TlsSlots         : [64] Ptr64 Void
   +0x1680 TlsLinks         : _LIST_ENTRY
   +0x1690 Vdm              : Ptr64 Void
   +0x1698 ReservedForNtRpc : Ptr64 Void
   +0x16a0 DbgSsReserved    : [2] Ptr64 Void
   +0x16b0 HardErrorMode    : Uint4B
   +0x16b8 Instrumentation  : [11] Ptr64 Void
   +0x1710 ActivityId       : _GUID
   +0x1720 SubProcessTag    : Ptr64 Void
   +0x1728 EtwLocalData     : Ptr64 Void
   +0x1730 EtwTraceData     : Ptr64 Void
   +0x1738 WinSockData      : Ptr64 Void
   +0x1740 GdiBatchCount    : Uint4B
   +0x1744 CurrentIdealProcessor : _PROCESSOR_NUMBER
   +0x1744 IdealProcessorValue : Uint4B
   +0x1744 ReservedPad0     : UChar
   +0x1745 ReservedPad1     : UChar
   +0x1746 ReservedPad2     : UChar
   +0x1747 IdealProcessor   : UChar
   +0x1748 GuaranteedStackBytes : Uint4B
   +0x1750 ReservedForPerf  : Ptr64 Void
   +0x1758 ReservedForOle   : Ptr64 Void
   +0x1760 WaitingOnLoaderLock : Uint4B
   +0x1768 SavedPriorityState : Ptr64 Void
   +0x1770 SoftPatchPtr1    : Uint8B
   +0x1778 ThreadPoolData   : Ptr64 Void
   +0x1780 TlsExpansionSlots : Ptr64 Ptr64 Void
   +0x1788 DeallocationBStore : Ptr64 Void
   +0x1790 BStoreLimit      : Ptr64 Void
   +0x1798 MuiGeneration    : Uint4B
   +0x179c IsImpersonating  : Uint4B
   +0x17a0 NlsCache         : Ptr64 Void
   +0x17a8 pShimData        : Ptr64 Void
   +0x17b0 HeapVirtualAffinity : Uint4B
   +0x17b8 CurrentTransactionHandle : Ptr64 Void
   +0x17c0 ActiveFrame      : Ptr64 _TEB_ACTIVE_FRAME
   +0x17c8 FlsData          : Ptr64 Void
   +0x17d0 PreferredLanguages : Ptr64 Void
   +0x17d8 UserPrefLanguages : Ptr64 Void
   +0x17e0 MergedPrefLanguages : Ptr64 Void
   +0x17e8 MuiImpersonation : Uint4B
   +0x17ec CrossTebFlags    : Uint2B
   +0x17ec SpareCrossTebBits : Pos 0, 16 Bits
   +0x17ee SameTebFlags     : Uint2B
   +0x17ee SafeThunkCall    : Pos 0, 1 Bit
   +0x17ee InDebugPrint     : Pos 1, 1 Bit
   +0x17ee HasFiberData     : Pos 2, 1 Bit
   +0x17ee SkipThreadAttach : Pos 3, 1 Bit
   +0x17ee WerInShipAssertCode : Pos 4, 1 Bit
   +0x17ee RanProcessInit   : Pos 5, 1 Bit
   +0x17ee ClonedThread     : Pos 6, 1 Bit
   +0x17ee SuppressDebugMsg : Pos 7, 1 Bit
   +0x17ee DisableUserStackWalk : Pos 8, 1 Bit
   +0x17ee RtlExceptionAttached : Pos 9, 1 Bit
   +0x17ee InitialThread    : Pos 10, 1 Bit
   +0x17ee SpareSameTebBits : Pos 11, 5 Bits
   +0x17f0 TxnScopeEnterCallback : Ptr64 Void
   +0x17f8 TxnScopeExitCallback : Ptr64 Void
   +0x1800 TxnScopeContext  : Ptr64 Void
   +0x1808 LockCount        : Uint4B
   +0x180c SpareUlong0      : Uint4B
   +0x1810 ResourceRetValue : Ptr64 Void
kd> dt -b _TEB
nt!_TEB
   +0x000 NtTib            : _NT_TIB
      +0x000 ExceptionList    : Ptr64 
      +0x008 StackBase        : Ptr64 
      +0x010 StackLimit       : Ptr64 
      +0x018 SubSystemTib     : Ptr64 
      +0x020 FiberData        : Ptr64 
      +0x020 Version          : Uint4B
      +0x028 ArbitraryUserPointer : Ptr64 
      +0x030 Self             : Ptr64 
   +0x038 EnvironmentPointer : Ptr64 
   +0x040 ClientId         : _CLIENT_ID
      +0x000 UniqueProcess    : Ptr64 
      +0x008 UniqueThread     : Ptr64 
   +0x050 ActiveRpcHandle  : Ptr64 
   +0x058 ThreadLocalStoragePointer : Ptr64 
   +0x060 ProcessEnvironmentBlock : Ptr64 
   +0x068 LastErrorValue   : Uint4B
   +0x06c CountOfOwnedCriticalSections : Uint4B
   +0x070 CsrClientThread  : Ptr64 
   +0x078 Win32ThreadInfo  : Ptr64 
   +0x080 User32Reserved   : Uint4B
   +0x0e8 UserReserved     : Uint4B
   +0x100 WOW32Reserved    : Ptr64 
   +0x108 CurrentLocale    : Uint4B
   +0x10c FpSoftwareStatusRegister : Uint4B
   +0x110 SystemReserved1  : Ptr64 
   +0x2c0 ExceptionCode    : Int4B
   +0x2c8 ActivationContextStackPointer : Ptr64 
   +0x2d0 SpareBytes       : UChar
   +0x2e8 TxFsContext      : Uint4B
   +0x2f0 GdiTebBatch      : _GDI_TEB_BATCH
      +0x000 Offset           : Uint4B
      +0x008 HDC              : Uint8B
      +0x010 Buffer           : Uint4B
   +0x7d8 RealClientId     : _CLIENT_ID
      +0x000 UniqueProcess    : Ptr64 
      +0x008 UniqueThread     : Ptr64 
   +0x7e8 GdiCachedProcessHandle : Ptr64 
   +0x7f0 GdiClientPID     : Uint4B
   +0x7f4 GdiClientTID     : Uint4B
   +0x7f8 GdiThreadLocalInfo : Ptr64 
   +0x800 Win32ClientInfo  : Uint8B
   +0x9f0 glDispatchTable  : Ptr64 
   +0x1138 glReserved1      : Uint8B
   +0x1220 glReserved2      : Ptr64 
   +0x1228 glSectionInfo    : Ptr64 
   +0x1230 glSection        : Ptr64 
   +0x1238 glTable          : Ptr64 
   +0x1240 glCurrentRC      : Ptr64 
   +0x1248 glContext        : Ptr64 
   +0x1250 LastStatusValue  : Uint4B
   +0x1258 StaticUnicodeString : _UNICODE_STRING
      +0x000 Length           : Uint2B
      +0x002 MaximumLength    : Uint2B
      +0x008 Buffer           : Ptr64 
   +0x1268 StaticUnicodeBuffer : Wchar
   +0x1478 DeallocationStack : Ptr64 
   +0x1480 TlsSlots         : Ptr64 
   +0x1680 TlsLinks         : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x1690 Vdm              : Ptr64 
   +0x1698 ReservedForNtRpc : Ptr64 
   +0x16a0 DbgSsReserved    : Ptr64 
   +0x16b0 HardErrorMode    : Uint4B
   +0x16b8 Instrumentation  : Ptr64 
   +0x1710 ActivityId       : _GUID
      +0x000 Data1            : Uint4B
      +0x004 Data2            : Uint2B
      +0x006 Data3            : Uint2B
      +0x008 Data4            : UChar
   +0x1720 SubProcessTag    : Ptr64 
   +0x1728 EtwLocalData     : Ptr64 
   +0x1730 EtwTraceData     : Ptr64 
   +0x1738 WinSockData      : Ptr64 
   +0x1740 GdiBatchCount    : Uint4B
   +0x1744 CurrentIdealProcessor : _PROCESSOR_NUMBER
      +0x000 Group            : Uint2B
      +0x002 Number           : UChar
      +0x003 Reserved         : UChar
   +0x1744 IdealProcessorValue : Uint4B
   +0x1744 ReservedPad0     : UChar
   +0x1745 ReservedPad1     : UChar
   +0x1746 ReservedPad2     : UChar
   +0x1747 IdealProcessor   : UChar
   +0x1748 GuaranteedStackBytes : Uint4B
   +0x1750 ReservedForPerf  : Ptr64 
   +0x1758 ReservedForOle   : Ptr64 
   +0x1760 WaitingOnLoaderLock : Uint4B
   +0x1768 SavedPriorityState : Ptr64 
   +0x1770 SoftPatchPtr1    : Uint8B
   +0x1778 ThreadPoolData   : Ptr64 
   +0x1780 TlsExpansionSlots : Ptr64 
   +0x1788 DeallocationBStore : Ptr64 
   +0x1790 BStoreLimit      : Ptr64 
   +0x1798 MuiGeneration    : Uint4B
   +0x179c IsImpersonating  : Uint4B
   +0x17a0 NlsCache         : Ptr64 
   +0x17a8 pShimData        : Ptr64 
   +0x17b0 HeapVirtualAffinity : Uint4B
   +0x17b8 CurrentTransactionHandle : Ptr64 
   +0x17c0 ActiveFrame      : Ptr64 
   +0x17c8 FlsData          : Ptr64 
   +0x17d0 PreferredLanguages : Ptr64 
   +0x17d8 UserPrefLanguages : Ptr64 
   +0x17e0 MergedPrefLanguages : Ptr64 
   +0x17e8 MuiImpersonation : Uint4B
   +0x17ec CrossTebFlags    : Uint2B
   +0x17ec SpareCrossTebBits : Pos 0, 16 Bits
   +0x17ee SameTebFlags     : Uint2B
   +0x17ee SafeThunkCall    : Pos 0, 1 Bit
   +0x17ee InDebugPrint     : Pos 1, 1 Bit
   +0x17ee HasFiberData     : Pos 2, 1 Bit
   +0x17ee SkipThreadAttach : Pos 3, 1 Bit
   +0x17ee WerInShipAssertCode : Pos 4, 1 Bit
   +0x17ee RanProcessInit   : Pos 5, 1 Bit
   +0x17ee ClonedThread     : Pos 6, 1 Bit
   +0x17ee SuppressDebugMsg : Pos 7, 1 Bit
   +0x17ee DisableUserStackWalk : Pos 8, 1 Bit
   +0x17ee RtlExceptionAttached : Pos 9, 1 Bit
   +0x17ee InitialThread    : Pos 10, 1 Bit
   +0x17ee SpareSameTebBits : Pos 11, 5 Bits
   +0x17f0 TxnScopeEnterCallback : Ptr64 
   +0x17f8 TxnScopeExitCallback : Ptr64 
   +0x1800 TxnScopeContext  : Ptr64 
   +0x1808 LockCount        : Uint4B
   +0x180c SpareUlong0      : Uint4B
   +0x1810 ResourceRetValue : Ptr64 
kd> dt -b _KTHREAD
nt!_KTHREAD
   +0x000 Header           : _DISPATCHER_HEADER
      +0x000 Type             : UChar
      +0x001 TimerControlFlags : UChar
      +0x001 Absolute         : Pos 0, 1 Bit
      +0x001 Coalescable      : Pos 1, 1 Bit
      +0x001 KeepShifting     : Pos 2, 1 Bit
      +0x001 EncodedTolerableDelay : Pos 3, 5 Bits
      +0x001 Abandoned        : UChar
      +0x001 Signalling       : UChar
      +0x002 ThreadControlFlags : UChar
      +0x002 CpuThrottled     : Pos 0, 1 Bit
      +0x002 CycleProfiling   : Pos 1, 1 Bit
      +0x002 CounterProfiling : Pos 2, 1 Bit
      +0x002 Reserved         : Pos 3, 5 Bits
      +0x002 Hand             : UChar
      +0x002 Size             : UChar
      +0x003 TimerMiscFlags   : UChar
      +0x003 Index            : Pos 0, 6 Bits
      +0x003 Inserted         : Pos 6, 1 Bit
      +0x003 Expired          : Pos 7, 1 Bit
      +0x003 DebugActive      : UChar
      +0x003 ActiveDR7        : Pos 0, 1 Bit
      +0x003 Instrumented     : Pos 1, 1 Bit
      +0x003 Reserved2        : Pos 2, 4 Bits
      +0x003 UmsScheduled     : Pos 6, 1 Bit
      +0x003 UmsPrimary       : Pos 7, 1 Bit
      +0x003 DpcActive        : UChar
      +0x000 Lock             : Int4B
      +0x004 SignalState      : Int4B
      +0x008 WaitListHead     : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
   +0x018 CycleTime        : Uint8B
   +0x020 QuantumTarget    : Uint8B
   +0x028 InitialStack     : Ptr64 
   +0x030 StackLimit       : Ptr64 
   +0x038 KernelStack      : Ptr64 
   +0x040 ThreadLock       : Uint8B
   +0x048 WaitRegister     : _KWAIT_STATUS_REGISTER
      +0x000 Flags            : UChar
      +0x000 State            : Pos 0, 2 Bits
      +0x000 Affinity         : Pos 2, 1 Bit
      +0x000 Priority         : Pos 3, 1 Bit
      +0x000 Apc              : Pos 4, 1 Bit
      +0x000 UserApc          : Pos 5, 1 Bit
      +0x000 Alert            : Pos 6, 1 Bit
      +0x000 Unused           : Pos 7, 1 Bit
   +0x049 Running          : UChar
   +0x04a Alerted          : UChar
   +0x04c KernelStackResident : Pos 0, 1 Bit
   +0x04c ReadyTransition  : Pos 1, 1 Bit
   +0x04c ProcessReadyQueue : Pos 2, 1 Bit
   +0x04c WaitNext         : Pos 3, 1 Bit
   +0x04c SystemAffinityActive : Pos 4, 1 Bit
   +0x04c Alertable        : Pos 5, 1 Bit
   +0x04c GdiFlushActive   : Pos 6, 1 Bit
   +0x04c UserStackWalkActive : Pos 7, 1 Bit
   +0x04c ApcInterruptRequest : Pos 8, 1 Bit
   +0x04c ForceDeferSchedule : Pos 9, 1 Bit
   +0x04c QuantumEndMigrate : Pos 10, 1 Bit
   +0x04c UmsDirectedSwitchEnable : Pos 11, 1 Bit
   +0x04c TimerActive      : Pos 12, 1 Bit
   +0x04c Reserved         : Pos 13, 19 Bits
   +0x04c MiscFlags        : Int4B
   +0x050 ApcState         : _KAPC_STATE
      +0x000 ApcListHead      : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
      +0x020 Process          : Ptr64 
      +0x028 KernelApcInProgress : UChar
      +0x029 KernelApcPending : UChar
      +0x02a UserApcPending   : UChar
   +0x050 ApcStateFill     : UChar
   +0x07b Priority         : Char
   +0x07c NextProcessor    : Uint4B
   +0x080 DeferredProcessor : Uint4B
   +0x088 ApcQueueLock     : Uint8B
   +0x090 WaitStatus       : Int8B
   +0x098 WaitBlockList    : Ptr64 
   +0x0a0 WaitListEntry    : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x0a0 SwapListEntry    : _SINGLE_LIST_ENTRY
      +0x000 Next             : Ptr64 
   +0x0b0 Queue            : Ptr64 
   +0x0b8 Teb              : Ptr64 
   +0x0c0 Timer            : _KTIMER
      +0x000 Header           : _DISPATCHER_HEADER
         +0x000 Type             : UChar
         +0x001 TimerControlFlags : UChar
         +0x001 Absolute         : Pos 0, 1 Bit
         +0x001 Coalescable      : Pos 1, 1 Bit
         +0x001 KeepShifting     : Pos 2, 1 Bit
         +0x001 EncodedTolerableDelay : Pos 3, 5 Bits
         +0x001 Abandoned        : UChar
         +0x001 Signalling       : UChar
         +0x002 ThreadControlFlags : UChar
         +0x002 CpuThrottled     : Pos 0, 1 Bit
         +0x002 CycleProfiling   : Pos 1, 1 Bit
         +0x002 CounterProfiling : Pos 2, 1 Bit
         +0x002 Reserved         : Pos 3, 5 Bits
         +0x002 Hand             : UChar
         +0x002 Size             : UChar
         +0x003 TimerMiscFlags   : UChar
         +0x003 Index            : Pos 0, 6 Bits
         +0x003 Inserted         : Pos 6, 1 Bit
         +0x003 Expired          : Pos 7, 1 Bit
         +0x003 DebugActive      : UChar
         +0x003 ActiveDR7        : Pos 0, 1 Bit
         +0x003 Instrumented     : Pos 1, 1 Bit
         +0x003 Reserved2        : Pos 2, 4 Bits
         +0x003 UmsScheduled     : Pos 6, 1 Bit
         +0x003 UmsPrimary       : Pos 7, 1 Bit
         +0x003 DpcActive        : UChar
         +0x000 Lock             : Int4B
         +0x004 SignalState      : Int4B
         +0x008 WaitListHead     : _LIST_ENTRY
            +0x000 Flink            : Ptr64 
            +0x008 Blink            : Ptr64 
      +0x018 DueTime          : _ULARGE_INTEGER
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Uint4B
         +0x000 u                : <unnamed-tag>
            +0x000 LowPart          : Uint4B
            +0x004 HighPart         : Uint4B
         +0x000 QuadPart         : Uint8B
      +0x020 TimerListEntry   : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
      +0x030 Dpc              : Ptr64 
      +0x038 Processor        : Uint4B
      +0x03c Period           : Uint4B
   +0x100 AutoAlignment    : Pos 0, 1 Bit
   +0x100 DisableBoost     : Pos 1, 1 Bit
   +0x100 EtwStackTraceApc1Inserted : Pos 2, 1 Bit
   +0x100 EtwStackTraceApc2Inserted : Pos 3, 1 Bit
   +0x100 CalloutActive    : Pos 4, 1 Bit
   +0x100 ApcQueueable     : Pos 5, 1 Bit
   +0x100 EnableStackSwap  : Pos 6, 1 Bit
   +0x100 GuiThread        : Pos 7, 1 Bit
   +0x100 UmsPerformingSyscall : Pos 8, 1 Bit
   +0x100 ReservedFlags    : Pos 9, 23 Bits
   +0x100 ThreadFlags      : Int4B
   +0x104 Spare0           : Uint4B
   +0x108 WaitBlock        : _KWAIT_BLOCK
      +0x000 WaitListEntry    : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
      +0x010 Thread           : Ptr64 
      +0x018 Object           : Ptr64 
      +0x020 NextWaitBlock    : Ptr64 
      +0x028 WaitKey          : Uint2B
      +0x02a WaitType         : UChar
      +0x02b BlockState       : UChar
      +0x02c SpareLong        : Int4B
   +0x108 WaitBlockFill4   : UChar
   +0x134 ContextSwitches  : Uint4B
   +0x108 WaitBlockFill5   : UChar
   +0x164 State            : UChar
   +0x165 NpxState         : Char
   +0x166 WaitIrql         : UChar
   +0x167 WaitMode         : Char
   +0x108 WaitBlockFill6   : UChar
   +0x194 WaitTime         : Uint4B
   +0x108 WaitBlockFill7   : UChar
   +0x1b0 TebMappedLowVa   : Ptr64 
   +0x1b8 Ucb              : Ptr64 
   +0x108 WaitBlockFill8   : UChar
   +0x1c4 KernelApcDisable : Int2B
   +0x1c6 SpecialApcDisable : Int2B
   +0x1c4 CombinedApcDisable : Uint4B
   +0x1c8 QueueListEntry   : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x1d8 TrapFrame        : Ptr64 
   +0x1e0 FirstArgument    : Ptr64 
   +0x1e8 CallbackStack    : Ptr64 
   +0x1e8 CallbackDepth    : Uint8B
   +0x1f0 ApcStateIndex    : UChar
   +0x1f1 BasePriority     : Char
   +0x1f2 PriorityDecrement : Char
   +0x1f2 ForegroundBoost  : Pos 0, 4 Bits
   +0x1f2 UnusualBoost     : Pos 4, 4 Bits
   +0x1f3 Preempted        : UChar
   +0x1f4 AdjustReason     : UChar
   +0x1f5 AdjustIncrement  : Char
   +0x1f6 PreviousMode     : Char
   +0x1f7 Saturation       : Char
   +0x1f8 SystemCallNumber : Uint4B
   +0x1fc FreezeCount      : Uint4B
   +0x200 UserAffinity     : _GROUP_AFFINITY
      +0x000 Mask             : Uint8B
      +0x008 Group            : Uint2B
      +0x00a Reserved         : Uint2B
   +0x210 Process          : Ptr64 
   +0x218 Affinity         : _GROUP_AFFINITY
      +0x000 Mask             : Uint8B
      +0x008 Group            : Uint2B
      +0x00a Reserved         : Uint2B
   +0x228 IdealProcessor   : Uint4B
   +0x22c UserIdealProcessor : Uint4B
   +0x230 ApcStatePointer  : Ptr64 
   +0x240 SavedApcState    : _KAPC_STATE
      +0x000 ApcListHead      : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
      +0x020 Process          : Ptr64 
      +0x028 KernelApcInProgress : UChar
      +0x029 KernelApcPending : UChar
      +0x02a UserApcPending   : UChar
   +0x240 SavedApcStateFill : UChar
   +0x26b WaitReason       : UChar
   +0x26c SuspendCount     : Char
   +0x26d Spare1           : Char
   +0x26e CodePatchInProgress : UChar
   +0x270 Win32Thread      : Ptr64 
   +0x278 StackBase        : Ptr64 
   +0x280 SuspendApc       : _KAPC
      +0x000 Type             : UChar
      +0x001 SpareByte0       : UChar
      +0x002 Size             : UChar
      +0x003 SpareByte1       : UChar
      +0x004 SpareLong0       : Uint4B
      +0x008 Thread           : Ptr64 
      +0x010 ApcListEntry     : _LIST_ENTRY
         +0x000 Flink            : Ptr64 
         +0x008 Blink            : Ptr64 
      +0x020 KernelRoutine    : Ptr64 
      +0x028 RundownRoutine   : Ptr64 
      +0x030 NormalRoutine    : Ptr64 
      +0x038 NormalContext    : Ptr64 
      +0x040 SystemArgument1  : Ptr64 
      +0x048 SystemArgument2  : Ptr64 
      +0x050 ApcStateIndex    : Char
      +0x051 ApcMode          : Char
      +0x052 Inserted         : UChar
   +0x280 SuspendApcFill0  : UChar
   +0x281 ResourceIndex    : UChar
   +0x280 SuspendApcFill1  : UChar
   +0x283 QuantumReset     : UChar
   +0x280 SuspendApcFill2  : UChar
   +0x284 KernelTime       : Uint4B
   +0x280 SuspendApcFill3  : UChar
   +0x2c0 WaitPrcb         : Ptr64 
   +0x280 SuspendApcFill4  : UChar
   +0x2c8 LegoData         : Ptr64 
   +0x280 SuspendApcFill5  : UChar
   +0x2d3 LargeStack       : UChar
   +0x2d4 UserTime         : Uint4B
   +0x2d8 SuspendSemaphore : _KSEMAPHORE
      +0x000 Header           : _DISPATCHER_HEADER
         +0x000 Type             : UChar
         +0x001 TimerControlFlags : UChar
         +0x001 Absolute         : Pos 0, 1 Bit
         +0x001 Coalescable      : Pos 1, 1 Bit
         +0x001 KeepShifting     : Pos 2, 1 Bit
         +0x001 EncodedTolerableDelay : Pos 3, 5 Bits
         +0x001 Abandoned        : UChar
         +0x001 Signalling       : UChar
         +0x002 ThreadControlFlags : UChar
         +0x002 CpuThrottled     : Pos 0, 1 Bit
         +0x002 CycleProfiling   : Pos 1, 1 Bit
         +0x002 CounterProfiling : Pos 2, 1 Bit
         +0x002 Reserved         : Pos 3, 5 Bits
         +0x002 Hand             : UChar
         +0x002 Size             : UChar
         +0x003 TimerMiscFlags   : UChar
         +0x003 Index            : Pos 0, 6 Bits
         +0x003 Inserted         : Pos 6, 1 Bit
         +0x003 Expired          : Pos 7, 1 Bit
         +0x003 DebugActive      : UChar
         +0x003 ActiveDR7        : Pos 0, 1 Bit
         +0x003 Instrumented     : Pos 1, 1 Bit
         +0x003 Reserved2        : Pos 2, 4 Bits
         +0x003 UmsScheduled     : Pos 6, 1 Bit
         +0x003 UmsPrimary       : Pos 7, 1 Bit
         +0x003 DpcActive        : UChar
         +0x000 Lock             : Int4B
         +0x004 SignalState      : Int4B
         +0x008 WaitListHead     : _LIST_ENTRY
            +0x000 Flink            : Ptr64 
            +0x008 Blink            : Ptr64 
      +0x018 Limit            : Int4B
   +0x2d8 SuspendSemaphorefill : UChar
   +0x2f4 SListFaultCount  : Uint4B
   +0x2f8 ThreadListEntry  : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x308 MutantListHead   : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x318 SListFaultAddress : Ptr64 
   +0x320 ReadOperationCount : Int8B
   +0x328 WriteOperationCount : Int8B
   +0x330 OtherOperationCount : Int8B
   +0x338 ReadTransferCount : Int8B
   +0x340 WriteTransferCount : Int8B
   +0x348 OtherTransferCount : Int8B
   +0x350 ThreadCounters   : Ptr64 
   +0x358 XStateSave       : Ptr64 
kd> dt -b _RTL_USER_PROCESS_PARAMETERS
nt!_RTL_USER_PROCESS_PARAMETERS
   +0x000 MaximumLength    : Uint4B
   +0x004 Length           : Uint4B
   +0x008 Flags            : Uint4B
   +0x00c DebugFlags       : Uint4B
   +0x010 ConsoleHandle    : Ptr64 
   +0x018 ConsoleFlags     : Uint4B
   +0x020 StandardInput    : Ptr64 
   +0x028 StandardOutput   : Ptr64 
   +0x030 StandardError    : Ptr64 
   +0x038 CurrentDirectory : _CURDIR
      +0x000 DosPath          : _UNICODE_STRING
         +0x000 Length           : Uint2B
         +0x002 MaximumLength    : Uint2B
         +0x008 Buffer           : Ptr64 
      +0x010 Handle           : Ptr64 
   +0x050 DllPath          : _UNICODE_STRING
      +0x000 Length           : Uint2B
      +0x002 MaximumLength    : Uint2B
      +0x008 Buffer           : Ptr64 
   +0x060 ImagePathName    : _UNICODE_STRING
      +0x000 Length           : Uint2B
      +0x002 MaximumLength    : Uint2B
      +0x008 Buffer           : Ptr64 
   +0x070 CommandLine      : _UNICODE_STRING
      +0x000 Length           : Uint2B
      +0x002 MaximumLength    : Uint2B
      +0x008 Buffer           : Ptr64 
   +0x080 Environment      : Ptr64 
   +0x088 StartingX        : Uint4B
   +0x08c StartingY        : Uint4B
   +0x090 CountX           : Uint4B
   +0x094 CountY           : Uint4B
   +0x098 CountCharsX      : Uint4B
   +0x09c CountCharsY      : Uint4B
   +0x0a0 FillAttribute    : Uint4B
   +0x0a4 WindowFlags      : Uint4B
   +0x0a8 ShowWindowFlags  : Uint4B
   +0x0b0 WindowTitle      : _UNICODE_STRING
      +0x000 Length           : Uint2B
      +0x002 MaximumLength    : Uint2B
      +0x008 Buffer           : Ptr64 
   +0x0c0 DesktopInfo      : _UNICODE_STRING
      +0x000 Length           : Uint2B
      +0x002 MaximumLength    : Uint2B
      +0x008 Buffer           : Ptr64 
   +0x0d0 ShellInfo        : _UNICODE_STRING
      +0x000 Length           : Uint2B
      +0x002 MaximumLength    : Uint2B
      +0x008 Buffer           : Ptr64 
   +0x0e0 RuntimeData      : _UNICODE_STRING
      +0x000 Length           : Uint2B
      +0x002 MaximumLength    : Uint2B
      +0x008 Buffer           : Ptr64 
   +0x0f0 CurrentDirectores : _RTL_DRIVE_LETTER_CURDIR
      +0x000 Flags            : Uint2B
      +0x002 Length           : Uint2B
      +0x004 TimeStamp        : Uint4B
      +0x008 DosPath          : _STRING
         +0x000 Length           : Uint2B
         +0x002 MaximumLength    : Uint2B
         +0x008 Buffer           : Ptr64 
   +0x3f0 EnvironmentSize  : Uint8B
   +0x3f8 EnvironmentVersion : Uint8B
